[
  [
    "ASP1201",
    "H3 Humanities & Soc Sci Research Prog",
    "The H3 Humanities and Social Sciences Research Programme is offered to Junior College students who have exceptional ability and aptitude in Economics, Geography, History, Literature in English, Chinese Language and Literature, and Malay Language and Literature. The student will embark on an independent study and research under the supervision of a NUS academic and will be assessed via an extended essay.",
    "4",
    "FASS Dean's Office/Office of Programmes",
    "Arts and Social Science",
    "approximately 120 hours of independent study and research and consultation with a NUS lecturer.",
    "Reading the relevant H2 subject."
  ],
  [
    "BCP4002",
    "Consulting Practicum",
    "The job scope of the Consulting Practicum is part of the initial negotiations between the students and the company. Through this, the students learn how to define a job scope, negotiate the resources, and negotiate the timeline and deliverables. The instructor is only involved in confirming the final agreement between the students and the company. It is an interactive process as the students have to make a preliminary survey of the company before finalising the job scope. The project is divided into stages -- planning, research and assessment, and recommendations. It is not the same as an industrial attachment as the students take a strategic approach to dealing with a real company issue - it is a consulting project, pure and simple. It is not an academic exercise as the research is focused on real work issues. Students use their skills learnt in library work and market research.",
    "8",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "All levels 1000 and 2000 foundation modules.  Additional prerequisites may be imposed by the supervisor(s) depending on the topics of research."
  ],
  [
    "BCP4002A",
    "Consulting Practicum",
    "The job scope of the Consulting Practicum is part of the initial negotiations between the students and the company. Through this, the students learn how to define a job scope, negotiate the resources, and negotiate the timeline and deliverables. The instructor is only involved in confirming the final agreement between the students and the company. It is an interactive process as the students have to make a preliminary survey of the company before finalising the job scope. The project is divided into stages -- planning, research and assessment, and recommendations. It is not the same as an industrial attachment as the students take a strategic approach to dealing with a real company issue - it is a consulting project, pure and simple. It is not an academic exercise as the research is focused on real work issues. Students use their skills learnt in library work and market research.",
    "0",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "All levels 1000 and 2000 foundation modules.  Additional prerequisites may be imposed by the supervisor(s) depending on the topics of research."
  ],
  [
    "BCP4002B",
    "Consulting Practicum",
    "The job scope of the Consulting Practicum is part of the initial negotiations between the students and the company. Through this, the students learn how to define a job scope, negotiate the resources, and negotiate the timeline and deliverables. The instructor is only involved in confirming the final agreement between the students and the company. It is an interactive process as the students have to make a preliminary survey of the company before finalising the job scope. The project is divided into stages -- planning, research and assessment, and recommendations. It is not the same as an industrial attachment as the students take a strategic approach to dealing with a real company issue - it is a consulting project, pure and simple. It is not an academic exercise as the research is focused on real work issues. Students use their skills learnt in library work and market research.",
    "8",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "All levels 1000 and 2000 foundation modules. Additional prerequisites may be imposed by the supervisor(s) depending o the topics of research."
  ],
  [
    "BHD4001",
    "Honours Dissertation",
    "The purpose of the Honours Dissertation is to provide the student with an opportunity to select and study a research problem of importance and present his findings logically and systematically in clear and concise prose.  The research topic can be either the study of a business problem involving the use of analytic or predictive models, or a research study using field research techniques or data analysis leading to sound generalisations and deductions, or a scientific analysis of a theoretical problem.  The student is expected to demonstrate (a) a good understanding of relevant methodology and literature (b) the significance and relevance of the problem (c) a logical and sound analysis and (d) a clear and effective presentation.",
    "12",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "Varies depending on topics of research"
  ],
  [
    "BHD4001A",
    "Honours Dissertation",
    "The purpose of the Honours Dissertation is to provide the student with an opportunity to select and study a research problem of importance and present his findings logically and systematically in clear and concise prose. The research topic can be either the study of a business problem involving the use of analytic or predictive models, or a research study using field research techniques or data analysis leading to sound generalisations and deductions, or a scientific analysis of a theoretical problem. The student is expected in this exercise to demonstrate (a) a good understanding of relevant methodology and literature (b) the significance and relevance of the problem (c) a logical and sound analysis and (d) a clear and effective presentation.",
    "0",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "Varies depending on topics of research"
  ],
  [
    "BHD4001B",
    "Honours Dissertation",
    "The purpose of the Honours Dissertation is to provide the student with an opportunity to select and study a research problem of importance and present his findings logically and systematically in clear and concise prose. The research topic can be either the study of a business problem involving the use of analytic or predictive models, or a research study using field research techniques or data analysis leading to sound generalisations and deductions, or a scientific analysis of a theoretical problem. The student is expected in this exercise to demonstrate (a) a good understanding of relevant methodology and literature (b) the significance and relevance of the problem (c) a logical and sound analysis and (d) a clear and effective presentation.",
    "0",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "Varies depending on topics of research"
  ],
  [
    "BHD4001C",
    "Honours Dissertation",
    "The purpose of the Honours Dissertation is to provide the student with an opportunity to select and study a research problem of importance and present his findings logically and systematically in clear and concise prose. The research topic can be either the study of a business problem involving the use of analytic or predictive models, or a research study using field research techniques or data analysis leading to sound generalisations and deductions, or a scientific analysis of a theoretical problem. The student is expected in this exercise to demonstrate (a) a good understanding of relevant methodology and literature (b) the significance and relevance of the problem (c) a logical and sound analysis and (d) a clear and effective presentation.",
    "12",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "Varies depending on topics of research"
  ],
  [
    "BIS3751",
    "Independent Study in Business",
    "The Independent Study Module in Business provides the opportunity for student to pursue an in-depth study of a Business topic or issue independently, but under the close supervision and guidance of an instructor. Through such a learning experience, not only will the student gain an indepth knowledge of the topic of interest, the skills acquired through such a process of independent knowledge acquisition will be invaluable for a career in the Business world. The personalized interaction with the instructor will also facilitate mentorship.",
    "4",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual student with their supervisor",
    "Varies according to the subject matter covered."
  ],
  [
    "BLD3003",
    "Personal Leadership Development",
    "\"This independent study module delves into the leadership experiences a leader may go through as an individual. Leaders are also individual persons like you and me. How to deal with the leadership role and personally make sense of what a person does as a leader thus constitutes an essential part of leadership training. This module will address these topics:\n• The Leader as an Individual\n• Personality Traits and Leader Behavior\n• Leadership World View and Attitude\n• Leadership Mind and Heart\n• What Does It Mean to be a Follower\n• Developing Personal Potential\"",
    "2",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "0-0-0-2.5-2.5-5",
    "(MNO1706/MNO1706X or PL3239) and MNO2705."
  ],
  [
    "BMC5001A",
    "Leadership",
    "This module covers the comparative (East-West) psychological perspectives on management. The psychological perspective addresses such topics as: comparative views on leadership; roles and functions of the chief executive; the role of power, influence and politics; establishing supportive communications;\nenhancing employee performance through motivation and empowerment; delegating for responsiveness; managing conflict, change and varied stakeholders. The psychological perspective will emphasize experiential\nlearning to enhance leadership skills.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5001B",
    "Managerial Skills",
    "This module covers the comparative (East-West) sociological perspectives on management. The sociological perspective includes coverage of: organization\nstructure and design; organization culture; control and coordination systems; the nature and functioning of small groups in organizations; and organization development and change. The sociological perspective will emphasize understanding of the imperatives of managing complex organizations to enhance managerial skills.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5002A",
    "Corporate Strategy",
    "This module focuses on the work of a leader for a business entity, the corporation, business, division or plant. The module concentrates on the skills and actions required of the general manager for the development, communication and implementation of strategic organizational choices in\nthe context of complex business situations. Typical topics include: perspectives on the role of firms in society; setting of mission and objectives; the concept of strategy; industry analysis, generic strategies; firm competencies; corporate\nstrategy and diversification; environmental analysis; strategy and structure; culture and other implementation processes; strategic leadership; organizational learning; stakeholder analysis and corporate ethics.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5002B",
    "Contemporary Issues in Strategy",
    "This module uses the strategic frameworks to explore specific contemporary issues faced by the general managers in different industries in the different regions of the world. The module will adopt a comparative perspective by first examining the evolution of strategic management practice in the West and in Asia, and then reconciling differences in practices from the viewpoint of an Asian manager.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5003A",
    "Decision Making",
    "This module provides for an appreciation of the business decision-making process from the perspective of senior executives. It focuses on the process involving problemformulation and model building. Possible biases and pitfalls in the decision making process are discussed. Hands-on experiences are induced for the students to appreciate and understand the biases and pitfalls, and to formulate strategy and methods to overcome their own biases and pitfalls.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5003B",
    "Information Management",
    "This module provides for an appreciation of the quantitative aspects of business decision-making from the perspective of senior executives as requesters and users of such analyses. The module will familiarize students with tools for arriving at solutions to problems and as means for communicating analyses and decisions within and outside the organization. This is not a course in number-crunching. Focus is on understanding the concepts and how these can be gainfully applied.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5004A",
    "Managerial Economics",
    "The objective of this module is to provide a foundation for the understanding of the economic environment of business. It covers an overview of macroeconomic indicators and their determinants; the functioning of markets; the tools of macroeconomic management (monetary, exchange rate and fiscal policies); and industrial policy, especially the role of technology, externalities, market failures, imperfect competition, and strategic trade policy in influencing national competitiveness.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5004B",
    "Asian Markets and Industries",
    "The objective of this module is to provide a foundation for the understanding of the political environment of business. It presents an overview of the international political system, emphasizing international economic relations as they concern business executives rather than politicians and diplomats. Concepts covered include: the balance of power, national interest, sovereignty, international law, and diplomacy; prospects for world-order transformation; regional cooperation; North-South relations; technology transfer in the world economy; and the globalization of financial markets.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5005A",
    "International Business",
    "This module provides for an understanding of cross-border economic activities, especially international trade and foreign direct investment. It examines how culture and politics influence the processes and outcomes of international business, especially the contemporary sociopolitical economy of trade and investment. Other topics include international monetary system, regional economic integration and the strategy and structure of multinational enterprises. The aim is to sensitize the student to a wide array of concepts that, taken together, explain the phenomenon of globalization.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5005B",
    "International Business Law",
    "This module seeks to impart an understanding of the law by introducing the fundamental principles of contract, company law and commercial law. Topics covered include: principles relating to the formation of contract; how enforceable contract may be discharged; remedies for breach of enforceable contractual obligations; limited liability and the separate legal personality of corporate entities; duties and liabilities of directors; the law relating to insider trading and judicial management; passing of property and risk; implied conditions pertaining to a contract for the sale of goods; remedies against default in performance.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5006A",
    "Marketing Management",
    "The module provides executives with an understanding of marketing concepts, tools and techniques and their application in the analysis of marketing problems. The module covers topics such as the marketing concept; analysis of the marketing environment; buyer behavior; segmentation and targeting; development of marketing programmes and elements of the marketing mix: product, pricing, promotion and distribution. Issues in integrating the marketing mix and implementing, evaluating and controlling the marketing programme in the Asian context constitute a common theme of this module.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5006B",
    "Contemporary Issues in Marketing",
    "The module provides practical and relevant exposures to how the tools and frameworks covered in BMC5006a Marketing Management are operationalized in the real situations. The module focused on how behavioral changes induced by external and global conditions in economy, technology, culture and politics affect marketing.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5007A",
    "Accounting",
    "This module presents an overview of the principles of accounting, with a view to providing executives, who may not possess prior accounting training, with an understanding of accounting concepts. Topics include: the uses and limitations of accounting information for decision making and performance evaluation; the standard  techniques of financial control; valuation and capital budgeting; and the management of current assets and liabilities of the firm.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5007B",
    "Financial Management",
    "This module presents an overview of the principles of financial management, with a view to providing executives, who may not possess prior financial training, with an understanding of financial management concepts. Topics include: knowledge of financial resource management; the role of managers in maximizing the financial value of the firm; the standard techniques of financial analysis; financial markets and the environment in which businesses operate; capital structure and the cost of capital; and the choice of sources of financing.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5008A",
    "Organizational Behavior and Human Resource Management",
    "This module deals with the responsibilities of senior executives for the effective management and utilization of human resources. The central perspective is the crosscultural management of people within Asian businesses. Topics include: the design and management of personnel systems; planning, employee development and retention, staff appraisal and the design of rewards systems employee relations and collective bargaining; the implications of an aging population for human resources planning and management; and comparative perspectives on HRM; and managing professional employees, whose competencies and specialized knowledge increasingly determine and sustain competitive advantage.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5008B",
    "Contemporary Issues in Human Resouce Managment and Organuzational Behavior",
    "The module will deal with critical HR issues arising from new business challenges of the 21st century, such as anticipated demographic and value changes in the labor force, business diversification and globalization, organizational reorienting and restructuring, and working relationships and corporate cultures in the process of transition.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5009A",
    "Systems & Operations Management",
    "Systems and operations management is the management of all internal activities directly related to the creation of goods and/or services through the transformation of inputs into outputs. This transformation process involves designing, planning, controlling, and executing activities. The objects dealt with involve manpower, materials, machines, facilities, and customers. The interaction and interrelationship of all the activities and objects makes the management of operations a challenging task. Managing these activities with a systems perspective is critical to the success of a company.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5009B",
    "Supply Chain Management",
    "Supply chain management is the management of all external activities related to the creation of goods and/or services. The business competition is no longer competition among firms, it is about competition among supply chains. The interaction and interrelationship of all entities in the supply chain makes the management of supply chain a challenging task. To be competitive in today’s global marketplace, a company must have effective and efficient operations management across and along its supply and demand network.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5010A",
    "Corporate Finance",
    "This module equips students with the frameworks and approaches to diagnose the financial status and health of a company by analyzing its financial statements. Based on the diagnostic, various potential remedies to improve the\nfinancial health of a company are discussed. The module will pay particular attentions on the similarities and differences among Singapore, Chinese and other foreign companies, focusing on publicly listed companies. The module will also explore specific issues such as merger and acquisition, and various forms of corporate financing.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5010B",
    "Corporate Governance",
    "Corporate Governance is to provide a solid understanding of corporate governance from an international perspective, drawing from the perspectives of academics, regulators, practitioners and policy-makers. The module will include an overview of corporate governance and corporate governance mechanisms that help control managerial behaviour, different ownership structures, models and systems of corporate governance internationally, policy responses of different countries to corporate governance concerns, board of directors, board committees, external and internal auditing, executive and director compensation, disclosure and transparency, and communication with investors.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5011A",
    "Contemporary Issues in Business 1",
    "This is the first part of special topics module. The modules offered under this heading will address one or more of a range of important topics and issues in the management of Asian organizations. Examples of modules or topics include: contemporary issues in Asian business, East Asian (Japanese, Korean & Chinese) business and management systems, business-government relations in Asia, managing the China venture, managing in South Asia and managing the Asian multinational corporation.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMC5011B",
    "Contemporary Issues in Business 2",
    "This is the second part of special topics module. The modules offered under this heading will address one or more of a range of important topics and issues in the management of Asian organizations. Examples of modules or topics include: contemporary issues in Asian business, East Asian (Japanese, Korean & Chinese) business and management systems, business-government relations in Asia, managing the China venture, managing in South Asia and managing the Asian multinational corporation.",
    "3",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "24"
  ],
  [
    "BMO6015A",
    "Organizational Behavior Seminar: Entrepreneurship and Innovation",
    "The field of OB (Organizational Behavior) needs to know how organizations get started and developed – this is the field of entrepreneurship. Entrepreneurship needs to know how new ideas get developed – this is the field of innovation. The module presents the current scientific knowledge on entrepreneurs, how they behave and what are effective and ineffective behaviors – all of this from the\nOB perspective. It further asks the question, how innovations are developed. Entrepreneurship and innovations exist in small and large organizations, in for\nprofit and in non-for-profit organizations (e.g., as organizational culture). Thus, this is basic knowledge for OB PhDs.",
    "2",
    "Management and Organisation",
    "NUS Business School",
    "3-0-0-0-2-5"
  ],
  [
    "BSM3001",
    "Social Business Mission",
    "The Social Business Mission (SBM) will focus on the application of sustainable business concepts and principles in a regional setting with a clear social mission where you will take your head to business and a heart to the community.\n\nAs business professionals, you will investigate enterprise possibilities for a regional community through an entrepreneurial outreach programme in partnership with a host organisation, or university. This module will challenge you to apply what you have learnt in your BBA programme and impart your knowledge to communities in real worlds situations for the benefit of all stakeholders.",
    "4",
    "Finance",
    "NUS Business School",
    "3-0-0-'5 to 7 days on-site segment'-7"
  ],
  [
    "BSS4761",
    "Special Seminars in Business",
    "The seminars offered will involve both general and specialised issues relating to the business environment, which are worthy of an in-depth treatment from a\ngeneral management perspective.",
    "4",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies according to specific topics.",
    "Varies according to the subject matter covered."
  ],
  [
    "BST3002A",
    "SPIB: Economic Crisis 2008",
    "Review and analysis of the economic and financial crisis sparked by progressive defaults on sub-prime loans in U.S. The module will address the causes and consequences for both financial markets and the real economy in Singapore as well as globally.  The module will pay particular attention to various remedial policies and interventions by the U.S. and other governments.",
    "1",
    "Strategy and Policy",
    "NUS Business School",
    "6 hours of lectures"
  ],
  [
    "BST3761",
    "Special Topics in Business",
    "The topics offered will involve both general and specialised issues relating to\nthe business environment, which are worthy of an in-depth treatment from a\ngeneral management perspective.",
    "4",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies according to specific topics.",
    "Varies according to the subject matter covered."
  ],
  [
    "BT4101",
    "B.Sc. (Business Analytics) Dissertation",
    "The objective of this module is to enable students to work on an individual business analytics research project spanning two semesters, with approximately 400 hours of work. Students learn how to apply concepts and skills acquired from all prior modules taken and also to think of innovative ways of solving business analytics problems, and learn to work in a research and real-world business analytics environment. The project seeks to demonstrate the student’s work ethic, initiative, determination, and ability to think independently. On completion of the project, the student has to submit a dissertation which describes the project work and summarizes the findings, as well as to give an oral presentation before a panel of examiners.",
    "12",
    "Information Systems and Analytics",
    "Computing",
    "0-0-015-0",
    "Attained at least 70% of the MC requirement for degree"
  ],
  [
    "BZD6009",
    "Motivation and Interpersonal Processes",
    "This module will introduce graduate students to psychological foundations of organizational behaviour and consumer behaviour with a focus on motivation and interpersonal processes. Topics to be covered include goals, motivation, self-regulation, action regulation, construals, heuristics and biases, decision making under uncertainty, self and identity, ethics, fairness, trust, diversity, culture, norms, groups and teams, social exchange, power, status, and hierarchy. The course will introduce students to basic research in social, personality, and cognitive psychology on these topics. Class discussions will focus on applying the ideas from basic research to applied research in organizational behaviour and consumer behaviour.",
    "4",
    "Management and Organisation",
    "NUS Business School",
    "0-3-0-0-3-4"
  ],
  [
    "BZD6011",
    "Advanced Quantitative Research Methods",
    "",
    "4",
    "Management and Organisation",
    "NUS Business School",
    "0-3-0-0-3.5-3.5"
  ],
  [
    "CE1101",
    "Civil Engineering Principles and Practice",
    "From impressive tall buildings, to spectacular long suspension bridges, to very large floating structures, these structures must withstand both the forces of nature and the forces that mankind has intended for them. The analytical tools that engineers use to create these structures are deceivingly simple, and it is the intent of this module to explain things in a clear, straightforward manner. Students will learn how to estimate the loads acting on structures and the basic principles governing how structures stay in equilibrium. They will also be exposed to the basic concepts of fluid mechanics and hydraulics.",
    "6",
    "Civil and Environmental Engineering",
    "Engineering",
    "2-2-2-2-3-4"
  ],
  [
    "CE1102",
    "Principles & Practice in Infrastructure and Environment",
    "The impact of civil infrastructures on the environment is considerable and engineers have a significant role to play in developing technical solutions which must be cost-effective, economically feasible and environmentally sustainable. Sustainable development must consider all the repercussions from infrastructure development in a systematic and holistic way, including assessment of the resulting pollution problems through environmental monitoring and its necessary companion: safety control and management.",
    "6",
    "Civil and Environmental Engineering",
    "Engineering",
    "2-4-5-4"
  ],
  [
    "CE5104A",
    "Tunnelling in Soils",
    "This is an advanced module on analysis and design of tunnels in soils. The topics covered include bored tunnelling methods, stability of underground openings, ground movement prediction due to tunnels, effects of ground movements on buildings and structures, instrumentation and monitoring, and stresses on lining. The creation of underground structures to form subways,\nunderpasses, metro stations and other uses is an increasing requirement in major urban areas worldwide. Students are taught the various methods of construction for creating underground space.",
    "2",
    "Civil and Environmental Engineering",
    "Engineering",
    "1.5-0--0.5-3",
    "Background in Soil Mechanics or equivalent"
  ],
  [
    "CG2027",
    "Transistor-level Digital Circuits",
    "Building on the basic circuit concepts introduced through CG1111 and CG1112, this module introduces the fundamental concept of carriers, operating principles of PN diodes and MOSFETs. Their IV characteristic in different operating region and their impact on the performance of logic gate will also be discussed. It explains the foundational concepts of inverters and analyses their performance in terms of power and delay trade-off. It also introduces logic synthesis and the fundamental timing analysis of logic gates. Besides the\nstatic CMOS logic, it will also cover pass logics or transmission gates logics.",
    "2",
    "Computing and Engineering Programme",
    "Multi Disciplinary Programme",
    "1.5-0.5-0-0-3-5",
    "CG1111 Engineering Principles and Practice I OR\nCG1108 Electrical Engineering OR\nEG1112 Engineering Principles and Practice II",
    "EE2021 Devices and Circuit"
  ],
  [
    "CHC5314",
    "Chinese Religion",
    "This module will focus on the development of Chinese religions, including Taoism, Popular religion and Buddhism in China, as well as in the Chinese\nCommunity of Singapore. It also examines the transformation of these religions in history and developments of their core thoughts The module\ntakes a thematic approach, and will discuss in depth the important original texts and research publications in both the English and Chinese academic worlds.",
    "4",
    "Chinese Studies",
    "Arts and Social Science",
    "0-3-0-0-2-5"
  ],
  [
    "CN1101",
    "Chemical Engineering Principles and Practice I",
    "This  module provides an experiential   exposure   to chemical  engineering concepts through  a  series  of hands-on experimental laboratories. Simple yet visually engaging demonstrations  will  bring  these  concepts  to life, and act as a preview and bridge to the core modules in the undergraduate curriculum, while highlighting their practical relevance. The students will prepare for each session   by compulsory   pre-laboratory readings   on theoretical  background  and  laboratory  procedures.  In the laboratory, they will learn to carry out measurement, data  collection,  analysis,  modelling, interpretation  and presentation.  The  laboratory  sessions  will  be  blended with  real  engineering applications  of  industrial  and societal relevance to Singapore.",
    "6",
    "Chemical and Biomolecular Engineering",
    "Engineering",
    "2-3-4-2-1-3"
  ],
  [
    "CN1102",
    "Chemical Engineering Principles and Practice II",
    "This module  is  the  second  part of  a  two-part  module designed    to    provide    first    year    Chemical    and Biomolecular Engineering students with an experiential exposure to the foundational concepts of Biomolecular/Biochemical/Bioprocess Engineering, including mass  and  energy  balances,  biosafety  and sterile handling, bioreaction kinetics, bioreactor design, downstream  processing  and  purification,  biosystems modelling  and  optimization,  etc.,  through  a  series  of hands-on  experimental laboratories. In  the  laboratory, they   will   learn   to   carry   out   measurement,   data collection,    analysis,    modelling, interpretation    and presentation.  The  laboratory  sessions  will  be  blended with  real  engineering  applications  of  industrial  and societal relevance to Singapore\n.",
    "6",
    "Chemical and Biomolecular Engineering",
    "Engineering",
    "2-3-4-2-1-3"
  ],
  [
    "CP3101",
    "Topics in Computing",
    "The aim of this module is to provide a platform for innovative topics in computing that are not part of the regular curriculum to be presented to the students. This may include topics that are taught due to the availability of\na visiting expert, new developments in an area, or a particular event such as a competition that can be used to impart appropriate education to the students. The module may be offered as graded or CS/CU as appropriate to the topic.",
    "4",
    "SoC Dean's Office",
    "Computing",
    "10",
    "Depends on the topic being offered."
  ],
  [
    "DBA4761",
    "Seminars in Analytics",
    "This module is a placeholder for experimental or ad hoc elective modules in Analytics.",
    "4",
    "Analytics and Operations",
    "NUS Business School",
    "Varies, depending on specific subject matter covered.",
    "DAO2702, DBA3702 and DBA3803."
  ],
  [
    "DTS5736",
    "Systems Design Project",
    "The purpose of this module is to allow students to integrate\nmulti-dimensional defence technology that include C3,\nSensors and Intelligence, Artificial Intelligence, Guided\nWeapons, Unmanned Systems, Cyber, Operations\nResearch, Systems Engineering, etc, to study, formulate\nand analyse an actual military problem with the goal of\nrecommending a design solution with the principles of\nsystems engineering and design that involve complex\nsystems.",
    "2",
    "Temasek Defence Systems Inst",
    "Temasek Defence Sys. Institute",
    "0-2-0-4.5",
    "DTS5731 Fundamentals of Systems Engineering"
  ],
  [
    "DY5310",
    "Endodontics",
    "The Endodontic Residency Training Programme comprises of didactic, clinical and research components. Clinical training incorporating state-of-the-art technologies is corroborated with advanced didactic instruction in the principles of Endodontics and the basis for biomedical sciences. An array of features includes laboratory practical, seminars, lectures,literature reviews, multidisciplinary diagnostic and treatment planning sessions as well as undergraduate teaching. There may also be an opportunity for a 3-4 weeks attachment at Baylor College of Dentistry in USA for increased educational exposures.\n\nResearch is an integral part of the program and the resident is required to engage in a clinical or basic science research project. The resident is encouraged to attend conferences (both local and international) and present their research findings, conduct table-clinics, etc. at such meetings.\n\nThe main research interest of the Endodontic Residency Training Program is in the understan",
    "0",
    "Division of Graduate Dental Studies",
    "Dentistry",
    "Lectures: 450 hours, Clinics: 3150 hours, Seminars/Tutorial: 450 hours,Technique/Practical: 450 hou"
  ],
  [
    "DY5320",
    "Oral & Maxillofacial Surgery",
    "The Oral & Maxillofacial Surgery programme is a three-year programme, incorporating an applied basic science component to be taken in the first year. Students with a Primary MDS or its equivalent are exempted from the Basic Science course and Examination.\n\nThe Oral & Maxillofacial Surgery residency programme will enable the resident to:\n? Acquire the widest theoretical knowledge to be competent in the foundation for the practice\nof Oral & Maxillofacial Surgery;\n? Acquire the foundation and practical experience in Oral & Maxillofacial Surgery to be competent to enter into higher specialty training;\n? Effectively interface with other specialties and disciplines in patients requiring interdisciplinary management, especially in head and neck conditions, orthognathic surgery, cleft lip and palate management;\n? Acquire the experience to carry out research projects, to critically evaluate scientific publications and to communicate clinical and research papers in journals and conference",
    "0",
    "Division of Graduate Dental Studies",
    "Dentistry",
    "Lectures: 450 hours, Clinics: 3150 hours, Seminars/Tutorial: 450 hours,Technique/Practical: 450 hou"
  ],
  [
    "DY5330",
    "Orthodontics",
    "The Orthodontic Residency Training Programme is accredited by the Royal College of Surgeons of Edinburgh to enable candidates who successfully complete the course to sit for the Membership in Orthodontics (MOrthRCS Edinburgh). This enables the acquisition, by assessment, of the Fellowship of the College of Surgeons (FDSRCS Edinburgh) after 5 further years of clinical practice as a specialist.\n\nThe curriculum follows the recommended content by the Erasmus Committee which has been accepted by the European Commissioners in Brussels as satisfying the requirements for specialist practice in Europe.",
    "0",
    "Division of Graduate Dental Studies",
    "Dentistry",
    "Lectures: 450 hours, Clinics: 3150 hours, Seminars/Tutorial: 450 hours,Technique/Practical: 450 hou"
  ],
  [
    "EC5660",
    "Independent Study",
    "Independent research plays an important role in graduate education. The Independent Study module is designed to enable the student to explore an approved topic in Economics in depth. The student should approach a lecturer to work out an agreed topic, readings, and assignments for the module. A formal, written agreement is to be drawn up, giving a clear account of the topic, programme of study, assignments, evaluation, and other pertinent details. Head's and/or Graduate Coordinator's approval of the written agreement is required. Regular meetings and reports are expected. Evaluation is based on 100% Continuous Assessment and must be worked out between the student and the lecturer prior to seeking departmental approval.",
    "4",
    "Economics",
    "Arts and Social Science",
    "N/A-N/A-N/A-N/A-10"
  ],
  [
    "ECA5381",
    "Urban Economics",
    "The module provides an overview of key urban economic theories, including increasing return and spatial equilibrium, urban transportation and urban\nforms, housing choices and residential externalities, and urban growth and public finance. These theories are then applied to the analysis of urban challenges, such as urbanization, land‐use efficiency, housing affordability, and sustainable urban development.",
    "4",
    "Economics",
    "Arts and Social Science",
    "3-0-3-4"
  ],
  [
    "EE4436",
    "Fabrication Process Technology",
    "In the new information age, fabrication process technology continues to be employed in the manufacturing of ultrahigh density integrated circuits such as microprocessor devices in computers. This module focuses on the major process technologies and basic building blocks used in the fabrication of integrated circuits and other microelectronic devices (e.g., solar cells). Understanding of fabrication processes is essential for undergraduate students who wish to develop their professional career in the microelectronics industry such as in wafer fabrication plants, foundries and design houses.",
    "4",
    "Electrical and Computer Engineering",
    "Engineering",
    "2.5-0.5–0.5–2.5-4",
    "CG2027/EE2027 (for AY2017 intake & after) ; EE2021 (for AY2016 intake & prior)",
    "EE4411, EE4411E, EE4436E, TEE4436"
  ],
  [
    "EG1111",
    "Engineering Principles and Practice I",
    "This is part 1 of a 2-module package that introduces Year 1engineering students to what engineers do and to the engineer's thought process. These modules are Engineering Principles and Practice (EPP) I and II.\n\nEPP I will focus on the engineering principle of how systems work and fail and the engineering practice of how they are designed, built and valued. Students will be presented a practical engineering system, e.g., a drone or an underwater autonomous vehicle, or an engineering event, e.g., the Challenger space shuttle disaster. They are then guided to deconstruct the system into interconnected sub-systems. Through group discussions, they will be guided to explain using engineering principles how the system works and could fail through the interactions of its various component sub-systems. These interactions in the form of forces, energy flow or mass flow will then be analysed and the impact of their variation will be evaluated. Through these students will learn that practical engineering systems are not silos of specific engineering disciplines and that engineers use scaling techniques to analyse, model, design and build systems.",
    "6",
    "Mechanical Engineering",
    "Engineering",
    "3-2-0-0-3-4"
  ],
  [
    "EG1112",
    "Engineering Principles and Practice II",
    "This is part 2 of a 2-module package that introduces Year 1engineering students to what engineers do and to the engineer's thought process. These modules are Engineering Principles and Practice (EPP) I and II.\n\nEPP II will focus on the engineering principle of how systems are energized and controlled and the engineering practice of how they are designed, built and valued. The main assumption here is that most modern engineering systems are powered electrically. They convert some raw form of energy such as fuel (petrol, diesel) or battery (electrochemically stored energy), through a process of energy conversion into electrical energy. Hence energy sources and energy conversion, electrical energy distribution, electrical energy utilization through conversion into various functions, measurement of functions through\ntheir performance parameters will form the backbone of this module.",
    "6",
    "Mechanical Engineering",
    "Engineering",
    "6-2-0-0-3-4"
  ],
  [
    "EG2401",
    "Engineering Professionalism",
    "This module aims to alert and sensitise students on the kinds of situations that may arise in his professional career and teaches students to improve his/her skills in appreciating and dealing with the moral challenges posed by such situations. Students will acquire skills in dealing with ethical issues, learn about the 'codes of ethics' set by professional bodies and intellectual property rights and protection.",
    "3",
    "FoE Dean's Office",
    "Engineering",
    "2-1-0-0-4.5-7.5",
    "ES1501A, ES1501B, ES1501C, EG1413/ES1531 and Year 2 status"
  ],
  [
    "EG2401A",
    "Engineering Professionalism",
    "This module aims to alert and sensitise students on the kinds of situations that may arise in his professional career and teaches students to improve his/her skills in appreciating and dealing with the moral challenges posed by such situations. Students will acquire skills in dealing with ethical issues, learn about the 'codes of ethics' set by professional bodies and intellectual property rights and protection.",
    "2",
    "FoE Dean's Office",
    "Engineering",
    "2-1-0-0-4.5-7.5",
    "ES1501A, ES1501B, ES1501C, EG1413/ES1531 and\nYear 2 status",
    "EG2401"
  ],
  [
    "EG5911",
    "Research Methodology & Ethics",
    "This module provides engineering research students with the background knowledge on how to conduct research, based on best practices. Issues on good international ethical practices, technical writing skills and skills in scientific presentations will also be taught to the students. The mode of teaching will be based on integrated classroom lecture combined with interactive small group discussion for the lab session. Students will be assessed through assignment in addition to taking an online quiz.",
    "0",
    "FoE Dean's Office",
    "Engineering",
    "2-0-2-0-0-5"
  ],
  [
    "ESE1102",
    "Principles & Practice in Infrastructure and Environment",
    "The impact of civil infrastructures on the environment is considerable and engineers have a significant role to play in developing technical solutions which must be cost-effective, economically feasible and environmentally sustainable. Sustainable development must consider all the repercussions from infrastructure development in a systematic and holistic way, including assessment of the resulting pollution problems through environmental monitoring and its necessary companion: safety control and management.",
    "6",
    "Civil and Environmental Engineering",
    "Engineering",
    "2-4-5-4"
  ],
  [
    "ESE4404",
    "Bioenergy",
    "Sustainability is the key to economic growth in the twenty-first century. With increasing global demand for energy, growing energy insecurity, and adverse impact of fossil fuel consumption on climate change, it is necessary to focus efforts toward bioenergy production from renewable, low-cost and locally available feedstock such as biomass and biowastes. This course introduces the various theories and technologies for production of bioenergy from various feedstocks. Topics include anaerobic technology for production of methane, bioethanol, methanol, hydrogen and biodiesel from biowastes and biomass, and microbial fuel cell for direct electricity production. Other processes such as pyrolysis of biomass shall also be introduced. Students will gain a comprehensive knowledge on the various options and challenges facing the production of bioenergy.",
    "4",
    "Civil and Environmental Engineering",
    "Engineering",
    "3-1-0-0-3-3",
    "Year 3 standing or equivalent with background in fluid mechanics"
  ],
  [
    "ESP1111",
    "Engineering Principles In-Action",
    "Students will learn engineering fundamentals like forces & equilibrium, dynamics and understand how materials and structures work and fail. They will also learn the importance of safety in conducting engineering activities, units and dimensions, significant numbers, how to make good guesses to solve engineering problems, vector mechanics and create engineering drawings. The students apply these concepts through building a wooden tower, taking full control of its design, modelling and construction. They will test their towers on a shake-table, and the team with the best design, based on a pre-determined set of metrics, will be given due recognition.",
    "4",
    "Engineering Science Programme",
    "Engineering",
    "2 hours in the 1st week-0-6-2-2"
  ],
  [
    "EU3550",
    "Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the European Studies Programme, have relevance to the major, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the programme.",
    "4",
    "History",
    "Arts and Social Science",
    "Please see remarks",
    "Students should: have completed a minimum of 24 MC in European Studies; and have declared European Studies as their Major.",
    "Any other XX3550 internship modules (Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "FAS2551",
    "FASS Internship",
    "This module gives FASS students the opportunity to pursue an internship as part of their undergraduate study. Interested students will need to secure a position and perform an internship in a company or organization, either for 8-12 weeks full time in special term, or 12-16 weeks part time in a regular semester. They will submit journal entries and other written reports, and meet with an Academic Advisor and Workplace Supervisor. Through the process, students will be exposed to corporate culture, sharpen soft skills, practice what they have learned in the classroom, and gain useful work experience.",
    "4",
    "FASS Dean's Office/Office of Programmes",
    "Arts and Social Science",
    "0-0-0-40/16",
    "At least 2 regular Semesters before enrolment in the module.\nCohort 2018 and after: CFG1002 Career Catalyst.",
    "Cohort 2016 onwards: Students who have completed or are pursuing the year-long NOC programmes are not allowed to read this module. Students should therefore consider their options carefully before embarking on their internships."
  ],
  [
    "FAS2552",
    "FASS Extended Internship",
    "This module gives FASS students the opportunity to pursue an internship as part of their undergraduate study. Interested students will need to secure a position and perform an internship in a company or organization for 12-16 weeks. They will submit journal entries and other written reports, and meet with an Academic Advisor and Workplace Supervisor. Through the process, students will be exposed to corporate culture, sharpen soft skills, practice what they have learned in the classroom, and gain useful work experience.",
    "8",
    "FASS Dean's Office/Office of Programmes",
    "Arts and Social Science",
    "0-0-0-40",
    "At least 2 regular Semesters before enrolment in the module.\nCohort 2018 and after: CFG1002 Career Catalyst.",
    "Module may not be taken in the honours year, or used to delay honours.\nCohort 2016 onwards: Students who have completed or are pursuing the year-long NOC programmes are not allowed to read this module. Students should therefore consider their options carefully before embarking on their internships."
  ],
  [
    "FMA1201J",
    "FS: Generations",
    "This freshman seminar expands the students' perspective on generations by engaging them in a critical understanding of the multidisciplinary field of intergenerational studies.  What happen when generations drift apart?  what happen when generations unite?  How are generations construced in consumption, care, policies, familial and extra-familial relations across cultures?  The seminar engages the students through ethnographic texts, films, policy case studies, field trips and their own reflections on intergenerational exchanges.",
    "4",
    "Japanese Studies",
    "Arts and Social Science",
    "3-0-2-5",
    "Other Freshman Seminar Modules"
  ],
  [
    "FMS1202M",
    "FS: Mathematics in Science, Technology & Society",
    "Mathematics is the best known but least understood subject. It plays a\nfundamental role in the development of science, technology and society but it\nhas received little public recognition and is often misused or wrongly perceived\nas not useful in life. The seminar module will expose students to various views\non the nature of mathematics, the enterprise called mathematics and its role in\nthe development of science, technology and society. The module will also focus\non specific topics or issues in science, technology and society where\nmathematics have significant impact, such the 2007 financial crisis, the internet,\ndigital age, electronic commerce, epidemics and so forth. The topics and issues\nmay be introduced by the lecturer or identified by the students. The students\nmay focus on aspects of a topic that they are most interested in and at a\nmathematical level that they are comfortable with depending on their\nbackground. The mathematics would be elementary and mostly algorithmic and\ndiscrete in the beginning and will move gently up to a level, which may be\ndifferent for different students.",
    "4",
    "Mathematics",
    "Science",
    "2-4-4-0",
    "Students who have read a Freshman Seminar before will be precluded from reading a second Freshman Seminar.\n\nStudents staying in Residential Colleges in UTown who will be reading or have read the Junior Seminars will be precluded from reading Freshman Seminar in the Faculty."
  ],
  [
    "FMS1206B",
    "FS: Genetic Engineering",
    "Genetic engineering (or genetic modification, transgenic) is to modify genetic\nmaterials of living things according to human’s will. Is it beneficial or harmful?\nAre you aware of GMO (genetically modified organism) and GM food? Do you\nwant to favour or oppose these GM products? Should we modify the gene for\ncuring genetic diseases? Is it acceptable to use genetically modified animals for\norgan transplantation to human? Do you know that genetic modification can\nactually help to save the environment? This module will help students to\nunderstand the science behind genetic engineering and thus students can\nmake educated answers to the above questions. There are plenty of examples\nof genetic engineering and each student needs to choose one or few examples\nand try to understand how these products have been created; their benefits and\npotential hazards, if any, will be discussed in the class.",
    "4",
    "Biological Sciences",
    "Science",
    "2-0-3-5",
    "Students who have read a Freshman Seminar before will be precluded from reading a second Freshman Seminar.\n\nStudents staying in Residential Colleges in UTown who will be reading or have read the Junior Seminars will be precluded from reading Freshman Seminar in the Faculty."
  ],
  [
    "FSP4003",
    "Field Service Project",
    "Students will be given opportunities to work with real companies. The scope of the Field Service Project is part of the initial negotiations between the students and the company. It is an interactive process as the students have to make a preliminary survey of the company before finalising the job scope. The project is divided into stages– planning, research and assessment, and recommendations.",
    "8",
    "BIZ Dean's Office/MBA Office",
    "NUS Business School",
    "Varies depending on individual students with their supervisor",
    "Varies according to the nature of the project."
  ],
  [
    "FST2202",
    "Food Commodities in Costa Rica",
    "This module is part of an intensive six‐week summer program conducted with the University of Costa Rica (UCR). The first three weeks will be spent on campus in San Jose, with lectures and tutorials on a variety of food commodities including plant\nfood commodities and animal husbandry. Field trips will be conducted in the following two weeks to visit production farms and processing industries of plant and animal food commodities. During the sixth week, intensive food processing trials of several food commodities at the UCR pilot plant will be conducted. Students will be exposed to a large number of commodities that are essential raw materials for food products.\nAssessments include field trip reports and final examination on the last day of the summer program.",
    "6",
    "Chemistry",
    "Science",
    "2-2.5-5-10.7.5"
  ],
  [
    "FST3181",
    "Professional Placement",
    "This essential requirement for the FST major involves the student working in an industrial/governmental or similar institutions for a minimum period of 16 weeks. The aim is to introduce the student to the world of work and to improve their interpersonal skills.",
    "12",
    "Chemistry",
    "Science",
    "0-0-0-40-0 (Minimum 18 weeks of industrial attachment). Overseas internship will be subjected to special arrangements with a minimum of 16 weeks.",
    "Food Science & Technology Major"
  ],
  [
    "GE3550A",
    "GIS Internship Module",
    "This module presents Geography majors who are taking/ intend to declare GIS minor a unique opportunity to gain practical experience in using GIS. It allows the students to apply their geospatial technology skills, such as spatial database management, data visualization, and data analysis, in a real working environment. Through mentoring from internship managers of employing companies/public sectors and NUS advisors, students are trained to apply theoretical aspects of GIS for solving real-world problems. They will also be able to collaborate with colleagues from the employing company or agency, and develop research questions involving the use of GIS in environmental issues.",
    "4",
    "Geography",
    "Arts and Social Science",
    "See Remarks",
    "The GISIM is for Geography majors who are taking/ intend to declare GIS minor, subject to the specific requirements of the hiring company or government agency.\n\nStudents must have completed GE2215 Introduction to Geographic Information Systems, before taking this module. Some companies may also require students to pass GE2227 and/ or GE3238.",
    "GE3550B and any other XX3550 module"
  ],
  [
    "GE3550B",
    "Geography Internship",
    "Internships will take place in organizations or companies located in Singapore. Through the mentoring from internship managers of the employing companies/ organizations and NUS advisors, students are trained to apply theoretical aspects to solving real problems. Students will learn how policies and practices that they read about are applied in a real world situation. The hands-on experience they gain while on internship will provide an added dimension to their education. It will give them a practical edge and prepare them for work in the future.",
    "4",
    "Geography",
    "Arts and Social Science",
    "See Remarks",
    "Students should:\n1) have completed a minimum of 24 MCs in Geography; and\n2) have declared Geography as their major",
    "GE3550A and any other XX3550 module"
  ],
  [
    "GEK2501",
    "Understanding your Medications",
    "The module will introduce students in the humanities to the general principles of drug actions that underpin their therapeutic applications.  The science of drug action (pharmacology) will include two major areas of pharmacology, pharmacodynamics and pharmacokinetics, which provide the scientific foundation for the study of drug actions.  In dealing with the therapeutic applications of drug actions, examples of commonly used drugs for specific disease states will be discussed, and their possible side-effects highlighted.  The examples will illustrate the use of over-the-counter as well as prescription drugs.",
    "4",
    "Pharmacology",
    "Yong Loo Lin School (Medicine)",
    "2 lecture/tutorial hours + 5 project/assignment work hours + 3 preparatory hours",
    "Open only to 2nd, 3rd and 4th year students",
    "Preclusion(s): Medical, Dental, Pharmacy, Nursing and all 1st year students are precluded. Life Science students who have taken LSM3211 are also precluded. Life Science students who have taken GEK2501 will not be allowed to do LSM3211"
  ],
  [
    "IE1111",
    "ISE Principles and Practice I",
    "This module introduces first year engineering students to what engineers do and to the engineer's thought process.  This is a two-part module: Industrial and Systems Engineering Principles and Practice (EPP) I and II. Real Industrial and Systems Engineering systems will be used to show how engineers use this discipline of engineering to design, make and test systems.  Through grasping engineering fundamentals, students learn how engineering systems work and fail (EPP I).  Through learning of real systems, students learn how multi-disciplinary concepts are tied together (EPP II). The students will also learn basic design, experimentation and evaluation of engineering systems.",
    "6",
    "Industrial Systems Engineering and Management",
    "Engineering",
    "6-2-0-0-3-4"
  ],
  [
    "IE1112",
    "ISE Principles and Practice II",
    "This module introduces first year engineering students to what engineers do and to the engineer's thought process.  This is a two-part module: Industrial and Systems \nEngineering Principles and Practice (EPP) I and II. Real engineering systems will be used to show how engineers use different disciplines of engineering, and combine them to design, make and test systems.  Through grasping engineering fundamentals, students learn how engineering systems work and fail (EPP I).  Through learning of real systems, students learn how multi-disciplinary concepts are tied together (EPP II). The students will also learn basic design, experimentation and evaluation of engineering systems.",
    "6",
    "Industrial Systems Engineering and Management",
    "Engineering",
    "6-2-0-0-3-4",
    "IE1111 ISE Principles and Practices I"
  ],
  [
    "IEU3550",
    "Extended Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the European Studies Programme, have relevance to the major, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the programme.",
    "4",
    "History",
    "Arts and Social Science",
    "Please see remarks",
    "Students should: have completed a minimum of 24 MC in European Studies; and have declared European Studies as their Major.",
    "Any other XX3550 internship modules (Note: Students who change major may not do a second internship in their new major)."
  ],
  [
    "IJS3550",
    "Extended Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the department, have relevance to the major in JS, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "Japanese Studies",
    "Arts and Social Science",
    "Please see remarks",
    "Students should: have completed a minimum of 24 MC in JS; and have declared JS as their Major.",
    "Any other XX3550 internship modules (Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "INM3550",
    "Extended Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the Communications and New Media Programme, have relevance to the major in NM, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships for each semester will be advertised at the beginning of the semester before. Internships proposed by students will require the approval of the department. Student must apply for and be accepted to work in the company/organization offering the internship for a duration of 6 months (together with NM3550), on full time basis.",
    "4",
    "Communications and New Media",
    "Arts and Social Science",
    "3 months at the place of work on full time basis.",
    "(1) For NM Major only,\n(2) Read and pass a minimum of 80 MCs AND\n(3) Must read NM3550 concurrently",
    "Any other series-internship modules\n(Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "ISE3550",
    "Extended Internship",
    "Internships vary in length and take place within organisations or companies located in Singapore or Southeast Asian countries. Internships with organisations or companies in Southeast Asian countries will occur during the semester-in-SEA programme at the SEASP. \n\n\n\nAll internships are vetted and approved by the SEASP, have relevance to the major in Southeast Asian Studies, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "Southeast Asian Studies",
    "Arts and Social Science",
    "All internships must include a minimum of 120 hours, accumulated during one period.",
    "Students should:  have completed a minimum of 24 MC in Southeast Asian Studies; and  have declared Southeast Asian Studies as their Major.",
    "Any other XX3550 module. [Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "ISN3550",
    "Extended South Asian Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the South Asian Studies Programme, have relevance to\nthe major in South Asian Studies, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited  nternships will be advertised at the beginning of each semester. In exceptional cases, internships proposed by students may be approved by the department.",
    "4",
    "South Asian Studies",
    "Arts and Social Science",
    "All internships must include a minimum of 120 hours, accumulated during one period",
    "Students should: have completed a minimum of 24 MC in South Asian Studies ; and\nhave declared South Asian Studies as their Major.",
    "Any other XX3550 internship modules"
  ],
  [
    "JS3550",
    "Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the department, have relevance to the major in JS, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "Japanese Studies",
    "Arts and Social Science",
    "Please see remarks",
    "Students should: have completed a minimum of 24 MC in JS; and have declared JS as their Major.",
    "Any other XX3550 internship modules (Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "LI5101",
    "Supply Chain Mgt Thinking & Practice",
    "A good supply chain involves an integrated end-to-end management of material flows from sources of supply through plants to customers, as well as an efficient information system of monitoring the flows and improving operational efficiency. Given the global context in which supply chains are to be managed, there is also a need to appreciate the financial management and operations. The objective of the module is to lead students into developing correct perspectives and thinking skills\nneeded to manage a supply chain. The topics to be covered include evolution of supply chain thinking, components of a supply chain, principles and value of good SCM, SCM operation and coordination, different practices of SCM, technology in SCM.",
    "4",
    "Logistics Inst - Asia Pac",
    "Logistics Inst-Asia Pac",
    "1-2-4-3"
  ],
  [
    "LI5202",
    "Supply Chain Management Strategies and Case Studies",
    "This module enables students to learn a special area or application of supply chain management by an eminent visiting professor to TLIAP.",
    "4",
    "Logistics Inst - Asia Pac",
    "Logistics Inst-Asia Pac",
    "3-1-6"
  ],
  [
    "LI5203",
    "Global Logistics and Supply Chain Management",
    "This course aims to provide a unique enriching experiential\nlearning opportunity to gain a broader understanding and\ninsight into global logistics and supply chains. It will be\ndelivered via an intensive two-week summer school\nprogramme at an international partner university, such as\nKuhne Logistics University or the Logistikum at University\nof Applied Sciences Upper Austria.\nAdopting a case-based learning approach, students will\nexperience challenging real business cases and workshops\ndesigned to combine sophisticated theory with hands-on\npractical experience in industry. Students will be exposed\nto educational content with high practical industrial\nrelevance and innovative solutions for companies with\nstate-of-the-art expertise.\n\nThe cases will follow the logic and lines of a global supply\nchain: starting with supplier evaluation, to usage of\nmultimodal transport, cold chain logistics, set-up of SCM\nfunction in a company from scratch down to customer\ndelivery, customer segmentation, and ending with the\nchallenges of e-commerce and last-mile delivery.",
    "4",
    "Logistics Inst - Asia Pac",
    "Logistics Inst-Asia Pac",
    "Total workload = 130 hours",
    "LI5101 Supply Chain Management Thinking and Practice, or approval of Director (Degree Education), TLI-AP"
  ],
  [
    "LL5301",
    "Topics in Constitutional Law: Socio-Economic Rights",
    "The course provides a grounding in the international and\ntheoretical background to the constitutional protection of\nsocial rights; the substantive approach taken by courts to\nvarious social rights, and the interaction between social\nrights in various claims to equality and protection on the\npart of vulnerable groups. The topics covered in the class\nare thus:\n(1) theoretical debates on the nature of social rights,\nand the theoretical underpinnings for their\nrecognition qua rights;\n(2) international human rights law instruments\nrecognising social rights, and international human\nrights understandings of such rights;\n(3) constitutional debates about the capacity and\nlegitimacy of courts enforcing such rights, and\nparticular debates over concepts such as (a)\nweak-versus strong-form review, and (b) notions of\na ‘minimum core’ to social rights; and\n(4) the actual interpretation of enforcement of key\nsocial rights by courts, with a particular focus on\nthe right to housing, health care, water, food and\nsocial welfare and social security\n(5) questions of gender, poverty and social rights\n(6) the rights of children in relation to social rights\n(7) the rights of non-citizens",
    "4",
    "FoL Dean's Office",
    "Law",
    "03-0-0-7",
    "NUS Compulsory Core Law Curriculum or equivalent.",
    "LL4301V/LL5301V/LL6301V Topics in Constitutional Law: Socio-Economic Rights"
  ],
  [
    "LL6227",
    "Philanthropy, Non-profit Organizations, and the Law",
    "This module covers the legal and policy framework for civil society, non-profit organizations, and philanthropy in Asia, the United Kingdom, the United States, Australia and other jurisdictions, including the formation and ac tivities of \norganizations, capital formation and fundraising, state restrictions on activities, governance, donations from domestic and foreign sources, and o ther key topics.  In 2014 the instructor and students will undertake a publishing project on philanthropy, non-profit organizations and the law in Asia in collaboration with the International Center for Not-for-Profit Law (ICNL, which is based in Washington DC)",
    "4",
    "FoL Dean's Office",
    "Law",
    "0-3-0-07",
    "NUS Compulsory Core Curriculum or its equivalent"
  ],
  [
    "MDG5227",
    "Bio-Innovation & Entrepreneurship",
    "This course covers comprehensively the important elements required to build and develop a bio-business through a series of lectures and highly interactive tutorials, workshops and panel discussions with experts. A diverse team of lecturers will bring in expert practitioners’ experience and knowledge on  different aspects of a biobusiness. The course will guide the students through the process of generating an idea and developing it to a business pitch.",
    "4",
    "NUS Medicine Dean's Office",
    "Yong Loo Lin School (Medicine)",
    "1.5-1.5-3-4",
    "Open to students from Life Sciences, Dental, Medicine, School of Public Health, Nursing (ie. Life Sciences, BDS, MBBS, BSc (Pharm), BNursing), and Biomedical Engineering. In teamwork students must be able to develop and present a business-idea & -plan in the biotech\nor life sciences field."
  ],
  [
    "ME2121E",
    "Engineering Thermodynamics",
    "This course develops a good understanding of the basic concepts and application of thermodynamics required for the analysis, modeling and design of thermal-fluid systems in engineering practice. Major topics include: Review of First and Second Laws of Thermodynamics and their applications; Reversible and Irreversible processes; Entropy; Non-flow and flow processes; Cycles involving entropy changes; Power/refrigeration and air cycles; Ideal gas mixtures; Psychrometry and applications; Fuels; Combustion and First Law applied to combustion.",
    "4",
    "SCALE Dean's Office",
    "Cont and Lifelong Education",
    "3-0.5-0.25-2.4.25",
    "PC1431 or PC1431FC or PC1431X or equivalent",
    "TM1121, TME2121"
  ],
  [
    "ME6401",
    "Topics in Mechatronics 1",
    "In this module, several selected advanced topics in mechatronics that are of current research interest will be offered. Each student has to choose two of those topics. Topics covered are typically in the areas of robotics, control, machine vision, and artificial intelligence. Each topic chosen will require the student to read several research papers, write a term paper and do a term project. The module is mainly meant for research students to help them specialise in selected topics in mechatronics. ME6401 will be offered in Term I while ME6402 will be offered in Term II. The two modules typically cover a different set of topics.",
    "4",
    "Mechanical Engineering",
    "Engineering",
    "A good background in the topics selected"
  ],
  [
    "ME6402",
    "Topics in Mechatronics 2",
    "In this module, several selected advanced topics in mechatronics that are of current research interest will be offered. Each student has to choose two of those topics. Topics covered are typically in the areas of robotics, control, machine vision, and artificial intelligence. Each topic chosen will require the student to read several research papers, write a term paper and do a term project. The module is mainly meant for research students to help them specialise in selected topics in mechatronics. ME6401 will be offered in Term I while ME6402 will be offered in Term II. The two modules typically cover a different set of topics.",
    "4",
    "Mechanical Engineering",
    "Engineering",
    "A good background in the topics selected"
  ],
  [
    "MLE3202",
    "Materials for Biointerfaces",
    "Introduction to the interdisciplinary nature of biomedical materials; biology, chemistry, and materials science and engineering. Classes and properties of materials used in medicine and dentistry. Biological and biochemical properties of proteins, cells and tissues. Biocompatibility and host reactions to biomedical implant materials. Testing of biomedical materials. Degradation of biomedical materials. Past, present and future applications of materials in medicine and dentistry. Learning objectives: Introductory knowledge on biomedical materials.",
    "4",
    "Materials Science and Engineering",
    "Engineering",
    "3-0.5-0-0-5-6",
    "MLE1101 or MLE1111 or MLE1001 or MLE1002"
  ],
  [
    "MT5017",
    "Integrative Design Thinking Workshop",
    "This course introduces students to the core philosophy of Design Thinking, a methodology which integrates design, technology and business research to facilitate service and product innovation as well as strategic planning and\ndecision making for future scenarios.\n\nStudents are expected to develop three necessary skills: Ideation/observational abilities – “listening with their eyes”; prototyping - “thinking with their hands”; and innovate collaboratively in an interdisciplinary work environment.",
    "4",
    "Industrial Systems Engineering and Management",
    "Engineering",
    "1.25-1.25-5-2.5"
  ],
  [
    "MT5901",
    "Management Practicum",
    "",
    "2",
    "Industrial Systems Engineering and Management",
    "Engineering",
    "0-0-0-5-0-5"
  ],
  [
    "MUA2120",
    "Orchestral Repertoire for Double Bass 2B",
    "Orchestral Repertoire for Double Bass is an orchestral repertory class designed to give orchestral playing experience to the Double Bass majors of YSTCM.  In 13 sessions throughout the semester, the class will read and rehearse significant orchestral repertoire for Double Bass. Repertoire selected in this module will build on and complement repertoire studied in MUA2119. As with MUA2119, Double Bass students are expected to demonstrate aptitude in large ensemble playing including: orchestral concepts in sound, intonation, and blend, as well as a professional attitude in working with conductors and colleagues. This module also teaches them essential audition techniques and skills.",
    "2",
    "YSTCM Dean's Office",
    "YST Conservatory of Music",
    "1-0-0-4",
    "MUA2119 Orchestral Repertoire for Double Bass 2A"
  ],
  [
    "MUA2128",
    "Orchestral Repertoire for Woodwinds 2B",
    "Orchestral Repertoire for Woodwinds is an orchestral repertory class designed to give orchestral playing experience to the woodwinds majors of YSTCM.  In 13 sessions throughout the semester, the class will read and rehearse significant orchestral repertoire for woodwinds. Repertoire selected in this module will build on and complement repertoire studied in MUA2127. As with MUA2127, woodwinds students are expected to demonstrate aptitude in large ensemble playing including: orchestral concepts in sound, intonation, and blend, as well as a professional attitude in working with conductors and colleagues. This module also teaches them essential audition techniques and skills.",
    "2",
    "YSTCM Dean's Office",
    "YST Conservatory of Music",
    "1-0-0-4",
    "MUA2127 Orchestral Repertoire for Woodwinds 2A"
  ],
  [
    "MUA3120",
    "Orchestral Repertoire for Double Bass 3B",
    "Orchestral Repertoire for Double Bass is an orchestral repertory class designed to give orchestral playing experience to the Double Bass majors of YSTCM. In 13 sessions throughout the semester, the class will read and rehearse significant orchestral repertoire for Double Bass. Repertoire selected in this module will build on and complement repertoire studied in MUA3119. Double Bass students consolidate and further develop technical, musical, and stylistic skills and knowledge essential to this repertoire’s effective execution. This module continues to develop professional audition performance techniques and skills.",
    "2",
    "YSTCM Dean's Office",
    "YST Conservatory of Music",
    "1-0-0-4",
    "MUA3119 Orchestral Repertoire for Double Bass 3A"
  ],
  [
    "MUA3128",
    "Orchestral Repertoire for Woodwinds 3B",
    "Orchestral Repertoire for Woodwinds is an orchestral repertory class designed to give orchestral playing experience to the woodwinds majors of YSTCM. In 13 sessions throughout the semester, the class will read and rehearse significant orchestral repertoire for woodwinds. Repertoire selected in this module will build on and complement repertoire studied in MUA3127. Woodwinds students consolidate and further develop technical, musical, and stylistic skills and knowledge essential to this repertoire’s effective execution. This module continues to develop professional audition performance techniques and skills.",
    "2",
    "YSTCM Dean's Office",
    "YST Conservatory of Music",
    "1-0-0-4",
    "MUA3127 Orchestral Repertoire for Woodwinds 3A"
  ],
  [
    "MUA3130",
    "Percussion Audition Techniques 3B",
    "In this module, the art and science of orchestral percussion auditions is imparted in a blend of theory and mock auditions.  Audition strategies and techniques are related and reinforced, including defeating physical manifestations of nervousness (such as cold or shaking hands), goal-oriented training in a wide variety of instruments, and performing at peak levels on all families of percussion instruments on any given day. The contents of this module will build on and complement MUA3182 Percussion Audition Techniques 3A.",
    "2",
    "YSTCM Dean's Office",
    "YST Conservatory of Music",
    "1-0-0-4",
    "MUA3129 Orchestral Repertoire for Percussion 3A"
  ],
  [
    "NM3226",
    "Location-based interactive experiences",
    "Designers of interactive digital media are increasingly focusing on issues, concerns, and approaches towards designing for location- and context-specific interactive experiences. This module aims to develop the students’ appreciation of the challenges confronting the design of interactive experiences for sites and contexts that are leisure-based, pleasurable, and recreational. Students will be taught and will utilize skills/methods from the human computer interaction (HCI) development cycle. By the end of this course, students will be able to work in collaborative design teams, conduct independent design research, think critically about designing for site-specific experiences, and develop prototype systems that exemplify location-based interactive experiences.",
    "4",
    "Communications and New Media",
    "Arts and Social Science",
    "2-2-6"
  ],
  [
    "NM3550",
    "Communications & New Media Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the Communications and New Media Programme, have relevance to the major in NM, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships for each semester will be advertised at the beginning of the semester before. Internships proposed by students will require the approval of the department. Student must apply for and be accepted to work in the company/organization offering the internship for a duration of 6 months (together with INM3550), on full time basis.",
    "4",
    "Communications and New Media",
    "Arts and Social Science",
    "3 months at the place of work on full time basis.",
    "(1) For NM Major only,\n(2) Read and pass a minimum of 80 MCs AND\n(3) Must read INM3550 concurrently",
    "Any other series-internship modules\n(Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "NM5881",
    "Topics in Media Studies",
    "Topics in Media Studies introduce special, advanced or rotating topics currently not included in the graduate-level Communications and New Media curriculum. Topics in this module offer instruction in the various specializations of the media studies field, more advanced instruction on the basic theories and knowledge covered in the current modules, and/or research, discussion and analysis of issues of current interest in the field of media studies.",
    "4",
    "Communications and New Media",
    "Arts and Social Science",
    "0-3-0-0-4-3"
  ],
  [
    "NUR3103",
    "Clinical Decision Making",
    "The module provides students an opportunity to consolidate knowledge on anatomy, physiology, pathophysiology, pharmacology, medical and nursing knowledge in the care of patients with common conditions e.g. top ten causes of hospitalisation, mortality and common conditions seen in primary health care clinics. The learning will take place in a simulated learning environment using a problem-based learning approach.",
    "4",
    "Alice Lee Center for Nursing Studies",
    "Yong Loo Lin School (Medicine)",
    "1-2-2.5-4.5",
    "NUR2116 Medical/Surgical Nursing II"
  ],
  [
    "OT5913",
    "Professional Integration (Internship)",
    "Apply the overall knowledge acquired throughout the\ncoursework period to work on real issue/s in an industrial\nenvironment.",
    "12",
    "Civil and Environmental Engineering",
    "Engineering",
    "6 months"
  ],
  [
    "PC2239",
    "Special Problems in Undergrad Physics I",
    "The module is intended for a small cohort of undergraduates who have a strong aptitude for physics and who have demonstrated outstanding scholarship. The problems will be assigned on a case-by-case basis.",
    "4",
    "Physics",
    "Science",
    "to be designed on consultation",
    "Departmental Approval"
  ],
  [
    "PC2288",
    "Basic UROPS in Physics I",
    "Please note that only 4MCs can be accredited towards major requirements in case that a student undertakes 8MCs for both PC2288 and PC2289.",
    "4",
    "Physics",
    "Science",
    "To be designed on consultation",
    "PC1141 or PC1142, and Departmental Approval"
  ],
  [
    "PC3239",
    "Special Problems in Undergrad Physics II",
    "The module is intended for a small cohort of undergraduates who have a strong aptitude for physics and who have demonstrated outstanding scholarship. The problems will be assigned on a case-by-case basis.",
    "4",
    "Physics",
    "Science",
    "To be designed on consultation",
    "Departmental Approval."
  ],
  [
    "PC3288",
    "Advanced UROPS in Physics I",
    "Please note also that only 4MCs can be accredited towards major requirements in case that a student undertakes 8MCs for both PC3288 and PC3289.",
    "4",
    "Physics",
    "Science",
    "To be designed on consultation",
    "Departmental Approval"
  ],
  [
    "PC5216",
    "Advanced Atomic & Molecular Physics",
    "This module introduces from an experimentalists point of view to the modern world of ultracold quantum gases that so much changed atomic physics in the past two decades. The lectures present the basic experimental methods of\nlaser cooling, magnetic and optical trapping, and evaporative cooling that produce matter near absolute zero temperature. We then discuss basic effects like Bose-Einstein condensation and Pauli pressure. Further, selected research examples are presented that give insight to some of the many close relations between quantum matter designed in many labs worldwide and other physical systems found in the range of quantum information science, condensed matter physics, metrology, nuclear physics, and astronomy. Solid background in quantum\nmechanics, atomic physics, and statistical mechanics is desired.",
    "4",
    "Physics",
    "Science",
    "2x1.5-1-0-0-6"
  ],
  [
    "PC5239",
    "Special Problems in Physics",
    "The problems will be assigned on a case-by-case basis.",
    "4",
    "Physics",
    "Science",
    "To be designed on consultation",
    "Departmental approval"
  ],
  [
    "PP5104",
    "Empirical Analysis For Public Policy",
    "This course is an introduction to statistical methods. Topics covered include descriptive statistics, sampling, inference and bivariate and multiple regression analysis. Emphasis is on the application of these statistical techniques to public policy issues. Students will be introduced to the use of the computer. This module is mounted for MPP students.",
    "4",
    "LKYSPP Dean's Office",
    "LKY School of Public Policy",
    "4-1?-2-1-1?",
    "MP5104"
  ],
  [
    "PP5299",
    "Singapore: The City",
    "Singapore is both an Asian and global leader in urban planning and sustainable development. This module, cotaught by a Singaporean and an American (both political scientists), analyzes how Singapore has transformed itself in little more than four decades from a Third World city with dismal apparent prospects to the vibrant highamenity First World city it is today. The module focuses\non public policy formation and implementation, with particular attention to Singapore’s integrated pursuit of economic growth, environmental quality and\nsustainability, high-quality transport and housing, qualityof- life amenities, social peace, and nation building. Throughout, it links the analytics to real world examples, but mostly through sessions designed to enable direct interaction with policy-makers and civic organizations.Real world examples will also be drawn \nfrom other countries and urban regions.",
    "4",
    "LKYSPP Dean's Office",
    "LKY School of Public Policy",
    "2-1-4-3"
  ],
  [
    "PR4199",
    "Honours Project in Pharmacy",
    "Learning objectives: The research project work will start in the first semester of the academic year and last for 12 weeks. Each candidate will be required to carry out an independent laboratory-based or literature-based project under the supervision of an academic staff. A formal written report in the form of a research paper will be submitted for examination purpose.  Target students: Pharmacy Final Year",
    "12",
    "Pharmacy",
    "Science",
    "215 practical hours",
    "Completion of Level 3000 modules and subject to departmental approval.",
    "PR4196"
  ],
  [
    "PR4203",
    "Pharmacy Practice IV",
    "Learning objectives- To gain an awareness and understanding of systems and sub-systems health services from the perspectives of society, institution, practitioners and patients; to acquire a broad perspective on the roles of a pharmacist in the healthcare setting; to understand pharmacy polices and procedures in the healthcare setting- the formulary management system, clinical practice guidelines and the application of technology innovation in drug distribution; to understand the application of pharmaceutical knowledge to effect change in practice environments in the context of Medication misadventures and Drug Use Evaluation (DUE). Major topics: Structure, polices, programming and operation of healthcare systems; Hospital pharmacy management and services, roles of pharmacist, relationships with others in the community, policies and procedures; Hospital pharmacy management and services, roles of pharmacist, relationships with others in the community, policies and procedures; Medication management, Medication Distribution Systems, Purchasing and Inventory Control; Technology innovation in medication distribution; Medication errors and patient safety; Medication-Use Evaluation  objectives, process, process indicators, outcome indicators, roles and responsibilities, resources, pitfalls; Outcome Research; Pharmacoeconomics and Cost-effective Healthcare.  Target students: Pharmacy Final Year",
    "4",
    "Pharmacy",
    "Science",
    "3.0-0.5-2-4.5",
    "PR2131 Pharmacy Professional Skills Development II"
  ],
  [
    "SA4103",
    "Internet Application Development",
    "- Distributed Computing Infrastructure\n- Multimedia for Internet\n- Internet Programming using ASP.NET\n- Internet Project",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "9.7-4.9-0-4.9-0; 13-0-6.5-0-0; 19.5-13-13-0-0; 3.25-0-6.5-13-3.25"
  ],
  [
    "SA4104",
    "Software Engineering",
    "- Application Development Life Cycle III\n- Project Management",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "16.5-8-0-8-0; 20-0-6-6.5-0"
  ],
  [
    "SE3550",
    "Southeast Asian Studies Internship",
    "Internships vary in length and take place within organisations or companies located in Singapore or Southeast Asian countries. Internships with organisations or companies in Southeast Asian countries will occur during the semester-in-SEA programme at the SEASP. \n\nAll internships are vetted and approved by the SEASP, have relevance to the major in Southeast Asian Studies, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "Southeast Asian Studies",
    "Arts and Social Science",
    "All internships must include a minimum of 120 hours, accumulated during one period.",
    "Students should:  have completed a minimum of 24 MC in Southeast Asian Studies; and  have declared Southeast Asian Studies as their Major.",
    "Any other XX3550 module. [Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "SG3003",
    "Basic Java Programming",
    "This course is intended to give students a basic course in the Java Programming Language. It explains Reuse and Modularity and other Java mechanisms. Also it introduces Exception Handling, Java Class Libraries, Input/Output, Multithreading and Java Graphical User Interfaces. It will also prepare students for the Sun Java Programmer Certification Exams. This course is appropriate for all software developers without previous knowledge or experience in Java.",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "1.5*-0.5-0.5-3-1.8"
  ],
  [
    "SG4005",
    "Information Systems Security",
    "The objectives of this course is to provide learners with a holistic foundation in information systems security. An organization?s security is only as strong as its weakest link. Without a holistic approach to security that takes into account people, processes and technology, an organization may lull itself into a false sense of security. This e-learning course seeks to teach various IS security issues, including security management practices, cryptography, network security, application development security, security architecture, access control, operations security, physical security, security incident investigation and business continuity planning. There will be an assignment on IS security issues. This course is intended for IT professionals who need to ensure the security of their IT systems.",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "1.5*-0.5-0.5-3-1.8"
  ],
  [
    "SG4205",
    "Information Systems Security",
    "The objectives of this course is to provide learners with a holistic foundation in information systems security. An organization?s security is only as strong as its weakest link. Without a holistic approach to security that takes into account people, processes and technology, an organization may lull itself into a false sense of security. This e-learning course seeks to teach various IS security issues, including security management practices, cryptography, network security, application development security, security architecture, access control, operations security, physical security, security incident investigation and business continuity planning. There will be an assignment on IS security issues. This course is intended for IT professionals who need to ensure the security of their IT systems.",
    "3",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "1.5*-0.5-0.5-3-1.8"
  ],
  [
    "SG5010",
    "Strategic It Planning",
    "The objectives of this course are to show how to prepare the Strategic ICT Plan for an organization, how to align of the plan with business strategies, and how to effectively implement the plan. Topics covered will be; the Strategic IT Planning Framework; Critical Success Factors and identifying IT Opportunity; Industry Analysis and identify IT Opportunities; SWOT Analysis and IT Opportunities; Business Process and IT Opportunities; Selecting IT Opportunities; Overview of IT Architectures; Formalizing the IT Plan; IT Strategies and Policies; Creating and modifying IT Organizations. There will be an assignment on strategic IT planning issues. This course is intended for IT managers who need to create or understand strategic IT plans.",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "1.5*-0.5-0.5-3-1.8"
  ],
  [
    "SG5210",
    "Strategic It Planning",
    "The objectives of this course are to show how to prepare the Strategic ICT Plan for an organization, how to align of the plan with business strategies, and how to effectively implement the plan. Topics covered will be; the Strategic IT Planning Framework; Critical Success Factors and identifying IT Opportunity; Industry Analysis and identify IT Opportunities; SWOT Analysis and IT Opportunities; Business Process and IT Opportunities; Selecting IT Opportunities; Overview of IT Architectures; Formalizing the IT Plan; IT Strategies and Policies; Creating and modifying IT Organizations. There will be an assignment on strategic IT planning issues. This course is intended for IT managers who need to create or understand strategic IT plans.",
    "4",
    "Institute of Systems Science",
    "Institute of Systems Science",
    "1.5*-0.5-0.5-3-1.8"
  ],
  [
    "SN3277",
    "South Asia:Field Studies",
    "This module aims at providing students with a first-hand experience of the South Asian region in general, and with a deep insight and understanding of selected aspects/problems of South-Asia in particular.  The topics of the tours are different and formulated in accordance to the region chosen for the visit.  Possible topics are : (A) Tamil History and Culture (Tamil Nadu Tour), (B) India and IT development (Bangalore etc. Tour),  (C) Struggle for Independence; Partition (Tour around Delhi), etc.  The overall structure of the module would be as follows: 1 week of lectures (in situ in South Asia, so that 'hands-on' sessions are possible), 4 weeks of guided travel, 1 week for students' report-and-essay-writing (in South Asia) = 6 weeks.",
    "4",
    "South Asian Studies",
    "Arts and Social Science",
    "1 week of lectures (twice a day), 4 weeks of guided tours and  1 week for report writing",
    "Passed 8 MC of SN modules"
  ],
  [
    "SN3550",
    "Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the South Asian Studies Programe, have relevance to the major in South Asian Studies, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "South Asian Studies",
    "Arts and Social Science",
    "Please see remarks",
    "Students should have completed a minimum of 24 MCs in SN coded and SN recognised modules; and have declared South Asian Studies as their Major",
    "Any other XX3550 internship modules (Note: Students who change majors may not do a second internship in their new major)"
  ],
  [
    "SN6004",
    "South Asian Studies : Selected Topics Ii",
    "This module will take up subjects currently being researched or developed in the multidisciplinary field of South Asian Studies by faculty in the Programme and/or by visiting scholars. The module will be in the form of an on-going seminar covering a range of critical readings in different disciplines of the field. Students will select a particular topic which is appropriate and relevant to their own research interests and complete an extended essay on that topic.",
    "4",
    "South Asian Studies",
    "Arts and Social Science",
    "Workload: 2-1-0-4-3"
  ],
  [
    "SW3550",
    "Social Work Internship",
    "Internships vary in length but all take place within organisations or companies, are vetted and approved by the Department of Social Work, have relevance to the major in Social Work, involve the application of subject knowledge and theory in reflection upon the work, and are assessed. Available credited internships will be advertised at the beginning of each semester. Internships proposed by students will require the approval of the department.",
    "4",
    "Social Work",
    "Arts and Social Science",
    "Please see remarks",
    "Students should: have completed a minimum of 24 MC in Social Work; and have declared Social Work as their Major.",
    "Any other XX3550 internship modules (Note: Students who change major may not do a second internship in their new major)"
  ],
  [
    "TME2121",
    "Engineering Thermodynamics",
    "This course develops a good understanding of the basic concepts and application of thermodynamics required for the analysis, modeling and design of thermal-fluid systems in engineering practice. Major topics include: Review of First and Second Laws of Thermodynamics and their applications; Reversible and Irreversible processes; Entropy; Non-flow and flow processes; Cycles involving entropy changes; Power/refrigeration and air cycles; Ideal gas mixtures; Psychrometry and applications; Fuels; Combustion and First Law applied to combustion.",
    "4",
    "SCALE Dean's Office",
    "Cont and Lifelong Education",
    "3-0.5-0.25-2.4.25",
    "PC1431 or PC1431FC or PC1431X or equivalent",
    "TM1121, ME2121E"
  ],
  [
    "TS3245",
    "Professional Theatre Internship",
    "This module provides Arts 3 students majoring in Theatre Studies with the opportunity of an internship project in theatre organizations. It matches individual students' interests and skills with internship roles in stagecraft, stage production, event planning, theatre in education, research and administration offered by theatre companies.  Through research papers, regular reports, and a final presentation, students are trained to integrate theoretical knowledge with practical application, develop skills in teamwork and problem-solving, and form research parameters and gather data to address issues in theatre practice from a critical perspective.  Students are selected competitively on the basis of interviews and portfolios.",
    "4",
    "English Language and Literature",
    "Arts and Social Science",
    "Total of 150-200 hrs",
    "TS1101E. Only for TS Major students who are in or going into their third year."
  ],
  [
    "UAR2208",
    "From Lab to Stage: Writing the Science Play",
    "How do we turn science into art? This creative writing module examines how theatre explores issues of science - - the personal, institutional and social dimensions of scientific inquiry – as students create new original dramatic works. Students read and analyse science plays from a playwright’s perspective, and apply the techniques learned to their own short weekly creative writing exercises based on scientific developments. These will be critiqued by their peers, and will culminate in the research and writing of their own one-act plays.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Pre-requisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UHB2207",
    "Language, Cognition, and Culture",
    "This module explores the deep interconnections between language, cognition and culture. It begins with a consideration of the ‘discursive mind’ - that is, the particularly human way of knowing that uses language as its primary tool and medium. Realizing how much of human cognition is language-dependant,\nwe then explore the relations between language, cognition and culture by looking at such everyday linguistic phenomena as code-switching, metaphor and gesture. Augmenting the reading of sociolinguistic and cognitive science texts in this module, students will also learn how to collect and to analyze empirical\nevidence of language phenomena in order to more critically assess the claims of such texts.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP modules."
  ],
  [
    "UIT2206",
    "The Importance of Being Formal",
    "Formal methods of reasoning have been studied in all major civilizations, but the appearance of automatic computing devices in the 20th century has led to an explosion of interest in and applications of formal logic. Today, the advantages of formal reasoning are recognized and utilized far beyond computer science. Students of this module will discover the power as well as the limitations of formal methods for philosophy and mathematics, and learn to apply them in diverse areas such as political speeches and arguments, analysis of detective novels and the scheduling of sports tournaments.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "2-2-0-0-3-3",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UIT2208",
    "Thinking 4.0",
    "The 4th industrial revolution, combining notions from fields such as cybernetics, the maker world and artificial intelligence, is rapidly starting to take shape. The key\nunderlying human thought process is often represented by the term  ‘computational thinking’ but this thought process is much more than thinking like a programmer or computer-like. It is a broadly interdisciplinary process\nencompassing both the arts and the sciences, and essential for succeeding in an interconnected and data driven world. Indeed, thinking computationally is often\nmore like art than like math. This module, explores the thought processes behind computational thinking and considers applications in finance.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "4-0-4-2"
  ],
  [
    "ULS2208",
    "Biodiversity and Natural History in Singapore",
    "Situated within a megadiverse biodiversity-hotspot, Singapore has drastically-reduced natural areas yet remains surprisingly species-rich. Combined with her colonial legacy, infrastructural capabilities and cultural biases, Singapore offers a unique situation for studying biodiversity. In this module, we study how Singapore’s biodiversity landscape as well as the motivations and methods for studying biodiversity have evolved across Singapore’s history. Retracing how prominent naturalists explored Singapore’s biodiversity in the past, we imagine how they would do it today using current techniques. This module has a strong fieldwork component, imbuing students with naturalist sensibilities which heightens their awareness of Singapore’s diverse but oft-neglected natural heritage.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "2/4*-2/4*-2/4*-2/4*-6"
  ],
  [
    "ULT2298D",
    "Representing War",
    "War is the greatest common, man-made trauma that human beings undergo. We imagine war before, during and after we fight it. We imagine it socially, as tribes or nations, generating a common understanding through books, movies, songs and other representations. Those shared visions of war enable us to fight it and confront its trauma.\n\nThis module examines the changing imagination of war across history. Focusing mainly on English-speaking cultures, it examines poems, books, films, songs, plays, news reports, letters, speeches and tv programmes. It asks how they represent war, and how representations change over time and under pressure from technology, events and political thought.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6"
  ],
  [
    "ULT2299C",
    "Topics in Lit. 2: The Subject of Reading",
    "Where does meaning come from? Some people think that it resides in the text; some suggest that it originates from the author; others argue that meaning is created by the reader. This module examines the possibilities and problems of the last answer. To what extent does the reader of a text determine its meaning? Is there a universal, objective reader, or are readers historically specific, biased and always \"subjects\"? If a reader constructs the text, can the text in turn construct the reader? We will think about these questions by operating on several levels: (1) by discussing literature and films that thematise reading; (2) by assessing how thinkers have debated the reader's role; and (3) by examining our own processes of reading.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules / USP Advanced Multidisciplinary Seminars) may state general pre-requisite  skills/knowledge. Pre-requisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "ULT2299D",
    "The Politics of Language and Literacy in Singapore",
    "Whereas the goal of many literacy studies is to determine who is literate or what counts as literacy, the goal of this module is to examine the political, economic, and social assumptions, factors, and effects of the distinction\nbetween literacy and illiteracy. Although such a study could take place within any national context, this module will focus on Singapore as a location for taking up this issue. Organized around the literacy narratives and histories of \nUSP students older generations of Singaporeans, and people from other cultures and nations, this module explores the impact of the distinction between those who are literate and those who are not on Singaporean identity,\nhistory, politics, and ethics.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules.\nUSP Advanced modules (Course-Based Modules, CBMs)\nmay state general pre-requisite skills/knowledge. Prerequisites\nshould not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UNL2207",
    "The Nature of Natural Law",
    "This module examines the evolution of our present  theoretical understanding of some basic aspects of the physical world around us. It explores the role of certain\nprimitive concepts of science and how these key ideas have been used to construct a coherent ‘mental’ picture of the physical world. The particular focus this semester will be on a wellestablished and ‘deterministic’ law of nature: the Law of Universal Gravity and how this led to Newton’s prediction of the motion of the planets.\nThe module will also question, on a higher level, the nature of ‘scientific explanations’: how these are extended over time and inevitably get modified by having to take into account new ‘facts’ provided by observation and experiment.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "2-2-0-0-3-3",
    "Not applicable to USP modules.",
    "Not applicable to USP modules."
  ],
  [
    "UNL2209",
    "Quantum Reality and Appearance",
    "Can physics allow us to know the reality of nature or does it merely tell us how nature appears? Or for that matter, what are the limits of knowledge in physics, constrained as it is to giving responsible proof for the claims it makes?\nThis module explores some of the developments of quantum physics and how they bear on the philosophical notions of reality and appearances. The enquiry here will consist of an in-depth examination of the theoretical and experimental observations that claim to elucidate the notion of realism. Students will be taken through a journey that showcases the developments that have shaped our\ncurrent views on the topic.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP modules."
  ],
  [
    "UPC2207",
    "The Technology of Life - Machines That Go Squish",
    "Can we learn how man-made technologies work by taking a deeper, more quantitative look at how living organisms function? The nature of physical law imposes unique\nconstraints on the evolution and functioning of living organisms – the same constraints (and opportunities) we encounter when inventing technologies. This module will investigate how living organisms of all shapes and sizes have evolved creative solutions around natural constraints, and indeed turned these into opportunities for amazing feats of ‘natural’ engineering. To do this, students will learn important engineering fundamentals such as fluid mechanics and chemical and heat transport. The overall goals are to assemble a conceptual toolkit to analyse physical and chemical technologies, and to also highlight how nature can inspire new man-made technologies.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-2-4",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UPC2208",
    "Molecular Courtship",
    "How does an understanding of molecular interactions help us to make sense of everyday chemical phenomena to important chemical technologies? For example why are plastics non-biodegradable? Why and how an LED lights up or gets quenched, or one drug molecule works while another results in side effects? These are important outcomes resulting directly or indirectly from initial  intermolecular forces. Environmental issues such as differentiation between\nbiodegradable and “unfriendly” materials can also be discussed. Stereochemical or 3D-controlled intermolecular forces allow an understanding of many chemical processes in biological systems.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "2-2-2-4",
    "Not applicable to USP First-Tier modules.",
    "Not applicable to USP modules."
  ],
  [
    "UPI2206",
    "Creative Thinking",
    "Creativity seems to be an overused and vague buzzword, though only few would deny its fundamental role in an economic system which relies on innovations as a driving force. So what actually is creative thinking, can we foster it or is it just a matter of inspiration? We will analyze different forms of creativity with examples from history, research, technology and the arts. Then we will practice creative thinking and explore strategies how to manage innovative teams. To show that creative strategic thinking plays a role in various domains of society we turn towards negotiation and deal-making.We conclude with ideas how to communicate new ideas best and a discussion on creative leadership.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-4-2",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UPI2207",
    "Ethics and Aesthetics: The Moral Value of Representational Art",
    "This module examines the intersections between ethics (the study of what is right and wrong) and aesthetics (the study of beauty and taste) in light of two questions: (1) whether the appreciation of artworks makes us morally better persons, and (2) whether a moral defect make an artwork less beautiful. Students will study both historical and contemporary philosophical debates on these two issues, and make use of examples of representational art – i.e., artworks which depict an object, event or mental state – to explore their own positions. Examples of representational art examined include: novels, paintings, films, photographs, and museum exhibits.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3"
  ],
  [
    "UPI2208",
    "Imagining Animals",
    "How have artists, philosophers, and writers of fiction imagined the relation between humans and animals? Have they imagined humans as a species of animal, or as belonging to a realm of being that exceeds the lives of animals? What, if anything,\ndistinguishes us from animals: language, clothing, reason, or something else? In this course we will examine some of the ways these questions have been explored in art, advertising, philosophy, and literature. Students will consider how we look at\nanimals, read the views of influential philosophers, and immerse themselves in literary texts that imagine animals. The course will conclude with an examination of a provocative text by the novelist J. M. Coetzee, who stages a confrontation between philosophy and literature on the question of imagining animals.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules.",
    "Not applicable to USP modules."
  ],
  [
    "UQF2101E",
    "Quantitative Reasoning Foundation: Quantifying Our Eco-Footprint",
    "This topic-based module develops quantitative reasoning skills through a structured analysis of one important but accessible problem, imparting to students the appreciation that, for many questions/issues, a quantitative analysis can provide the insight and clarity that complements and moves beyond what might be gained through a qualitative approach.\n\nIn this particular iteration of the module, we will learn to make appropriate measurements to quantify the ecofootprint arising out of our current personal lifestyle\nchoices, conduct systematic thought/real experiments to explore improvement opportunities, and propose a modelbased sustainable alternative for ourselves, our families or communities such as the USP Residential College.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UQF2101F",
    "Quantitative Reasoning Foundation: Calculating Risks",
    "This topic-based module develops quantitative reasoning skills through a structured analysis of one important but accessible problem, imparting to students the appreciation that, for many questions/issues, a quantitative analysis can\nprovide the insight and clarity that complements and moves beyond what might be gained through a qualitative approach.\n\nIn this module, we will learn quantitative tools to understand and to quantify risks encountered in daily life; to compare and to weigh the consequences of these risks\nfor a more insightful decision-making. We will examine the underlying limitations of these tools.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules.\nUSP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "UQF2101H",
    "Quantitative Reasoning Foundation: War and  Democracy",
    "This topic-based module develops quantitative reasoning skills through a structured analysis of an important but accessible problem, imparting to students the appreciation that, for many questions/issues, a quantitative analysis can \nprovide the insight and clarity that complements and moves beyond what might be gained through a qualitative approach.  \n\nThis module focuses on interstate war, and how its likelihood is affected by countries’ regime types.  Does democracy cause peace between states?  Known as the “democratic peace theory,” this hypothesis will be investigated by students using quantitative analyses.  They will survey extant research and build empirical models to test the proposition.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "4-0-3-3",
    "Not applicable to USP First-Tier modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2306",
    "Disasters and Responses",
    "Focusing upon disasters and responses, this module interrogates the core issues underlying humanitarian interventions and development programs. This\nincludes consideration of environmental and social vulnerabilities, resilience, local capacities, the roles of beneficiaries, governments and NGOs, aid governance, and accountability.\n\nThe module draws upon literature from a wide range of disciplines to contextualize the diversity of theoretical and practical approaches involved in complex  humanitarian emergencies. The module utilizes extensive problem-based learning in which students engage with real world scenarios. The module is aimed for students interested in the inner workings of government, NGO and beneficiary interaction in humanitarian and development situations.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-2-4",
    "Not applicable to USP First-Tier modules.\nUSP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2308",
    "New Media and Politics",
    "This module explores and examines the dynamics between politics and new media in various realms. Earlier scholarship focused on politicians, parties and their electorate. However, with the increasing ubiquity of Internet technologies and user-generated content, political actors soon took on myriad dimensions and forms.\n\nStudents will acquire knowledge of foundational communication and political participation theories, as well as critically examine the relationship between media and political processes. The module also inculcates insights and knowledge on how media and politics play out in various arenas, such as political parties and campaigning, civil society organizations and grassroots movements.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2309",
    "Ordinary Politics",
    "This course will explore the ways in which seemingly nonpolitical everyday practices bear, or can come to have, ethical and political significance. We will look at philosophers and political theorists concerned with the ordinary activities of Speaking, Eating, Thinking and Walking, and how such activities reveal or inform, among other things, our concepts of responsibility, the human and the animal, the moral and political necessity of selfreflection, and the interactions between the individual and the natural and built environment. Thinkers to be read include Arendt, Austin, Benjamin, Cavell, Diamond, Singer, Thoreau, Rousseau and others.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2310",
    "Questioning Sustainable Development",
    "This module examines the tension between ‘need’ to ‘develop’ and imperatives of conserving natural resources in the backdrop of enormous socio-economic and environmental challenges we face today. Sustainable development (SD) emerged as a response to confront these challenges; whether it has served its purpose or not\nremains debatable. Different scientific, technological, economic and political instruments encompassing sustainable development (SD) will be critically evaluated.\nThe criticality of natural resources and their consumption patterns will be presented to the students. The need to engage local communities in new ways in social\nconstruction of SD would be discussed.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules.\nUSP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2311",
    "Archives, Biography, Memory in Singapore",
    "This module examines the intersections between archival materials, historical memory, and the writing of biography. It takes as a subject an archive in Singapore which has not been extensively used. Students will not only do practical work in terms of archival cataloguing and notation, but they will also study theoretical work on archives and biography, and critically examine biographical work in different media, before producing biographical work of their own. This module fulfils the Singapore Studies requirement.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3"
  ],
  [
    "USE2313",
    "Understanding Law and Social Change",
    "How does law affect people and society? How do people and society influence law? Can law bring about social change? In what ways? This course approaches the study\nof law as a social institution, and examines law, legal actors, and legal institutions from various perspectives such as sociology, psychology, political science, and legal\nscholarship. We will discuss theoretical perspectives on the relationship between law and society, the relationship between law and social behaviour, law in action in various social contexts, the role of law in social change, and the roles of lawyers, judges, and juries.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Second-year and above",
    "Not applicable to USP modules."
  ],
  [
    "USE2314",
    "Politics and Emotion",
    "Emotions, it is often said, has no place in politics. Where the former is thought to be primal and unruly, the latter is regarded as the realm of reason, of pragmatic and thoughtful deliberations. But how accurate is such a view?\nDon’t emotions typically accompany our political judgments and actions? Might they perhaps condition such responses, priming them and orienting us towards certain political attitudes and dispositions? Organized around five\nemotions—fear, disgust, grief, compassion, and hope— this module explores how emotions circulate within political life, how they emerge and are deployed for the mobilization of identities, sovereign legitimacy, ethical responsibility, and resistance.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP First-Tier modules.\nUSP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites should not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USE2319",
    "Social Movements, Law, and Society",
    "This course provides theoretical understanding and empirical knowledge about social movements and their relationship with law and society. How does collective mobilization emerge? We begin with this question and then\nturn to the different approaches of analyzing social movements. We will also consider how states and other movement opponents suppress and control social movements, and how movements respond to repression, and deploy, even spread, their ideas, strategies, and tactics within and across movements, as well as across national borders. In examining these issues, we will use\ncase studies, and discuss the role of law, including how it matters to the social control of social movements, movement strategies, tactics, and decision-making, and movement effects.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP modules."
  ],
  [
    "USP3508",
    "The Politics of the Body",
    "From the ‘Clean Hands” campaign to the heightened use of biometrics, the body has become a crucial site for political action, decision, and judgment. As a result,\ncorporeal registers— facial expressions, phenotype, movement, affective expressions, etc.—are now vital markers of difference, determining the degree to which one is recognized as ‘friend’ or ‘enemy’, ‘suspect’ or ‘innocent’, ‘citizen’ or ‘foreigner’. Organized around three prominently figured bodies—the tortured body, the racialized body, and the veiled body—in the post-9/11 global landscape and its current “War on Terror”, this module examines the ways in which the body is situated and implicated in relations of power, sovereignty, identity, and violence.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-2-4",
    "Not applicable to USP First-Tier modules.",
    "Not applicable to USP modules."
  ],
  [
    "USP3509",
    "Law and Violence",
    "The concept and practices of law are inseparable from the concepts and practices of force and/or violence. In this module we will investigate three questions. First, is there a difference between legitimate and illegitimate violence, and so, what is the difference and how is it explained? Secondly, what is the, and why is there an, internal relationship between law and violence? Finally, why do we punish? We will read texts from various thinkers, including Walter Benjamin, Bentham, Robert Cover, Derrida, Foucault, Kant, Locke, Nietzsche, Rousseau, A. John Simmons, Robert Paul Wolff and others.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules. USP Advanced modules (Course-Based Modules, CBMs) may state general pre-requisite skills/knowledge. Prerequisites\nshould not make reference to NUS modules.",
    "Not applicable to USP modules."
  ],
  [
    "USP3510",
    "Reason, Secularization & Multiculturalism",
    "This module investigates three inter-connected questions: Can science prove that religion is irrational? When reason becomes so powerful that it dominates nature, what ethical problems will arise? Is reason or religious faith more suitable in providing a foundation for multiculturalism? These three questions, which are still much debated today, actually arose in the Age of Enlightenment, an 18th century\nintellectual movement so important that it shaped the modern West, and even, arguably, the East. We will examine representative Enlightenment treatises on these questions, and reflect on how beliefs and principles involved are still operative in our age.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-3-3",
    "Not applicable to USP modules."
  ],
  [
    "UWC2101C",
    "Writing and Critical Thinking Module: Monuments, Memorials, and Commemoration",
    "This module explores how monuments, memorials and other forms of public commemoration represent the past and influence culture and politics in the present. It takes a comparative approach, using case studies from different societies. The module highlights the complexity and contested nature of commemoration and memorialization. Although monuments and memorials may be intended to\ntell the “true” version of historical events, the end result often hides controversies that may have been part of the process of designing these structures. Similarly, the\nmeanings attached to monuments and memorials can change dramatically over time, as societies change and these structures are reinterpreted.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules.",
    "Not applicable to USP modules."
  ],
  [
    "UWC2101V",
    "Writing & Critical Thinking: Language, Culture and 'Natives' People",
    "Depictions of ‘natives’, ‘primitives’ and ‘savages’ abound in the popular cultures of developed countries worldwide. In this module we will examine common stereotypes of native people and primitive cultures to uncover the underlying ideologies driving them, and analyze what cultural purpose such stereotypes serve in modern day life. We will seek to discern what palpable differences exist between primitive and modern people, and to confront the cultural and ethical conundrums entailed by those differences. Finally, we will explore how primitive people view modern society, and assess what the future may hold for native cultures in our fast globalizing world.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-6",
    "Not applicable to USP First-Tier modules."
  ],
  [
    "UWC2101Y",
    "Writing and Critical Thinking: Issues in and Around Justice",
    "This module teaches writing and critical thinking by introducing students to the assumptions that inform, and the arguments for, different concepts and practices of justice. Students will engage topics such as human rights, the place and limits of legal institutions, justifications for civil disobedience, and whether violence is justified in the pursuit of justice. This module enables students to think critically about theories of justice and how these theories shape the pursuit of justice in political life.",
    "4",
    "University Scholars Programme",
    "University Scholars Programme",
    "0-0-4-0-0-6",
    "Not applicable to USP First-Tier modules",
    "Not applicable to USP modules."
  ],
  [
    "YCT1201",
    "Transitions - Understanding College and College Life",
    "Transitions is a six-week optional elective module that supports all Yale-NUS first year students in their transition to college. Topics covered include goal setting, time management, maintaining wellness, understanding learning styles, study tips and effective note-taking, formal and informal communication, and understanding academic regulations. Students are expected to further their learning by meeting up with their Deans Fellows outside of class time.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "0-8-20-2",
    "N.A.",
    "N.A."
  ],
  [
    "YSC2207",
    "Techniques in Analytical Chemistry",
    "This course is an introduction to laboratory techniques in analytical chemistry. It focuses on basic analytical and instrumental methods widely used in the chemistry laboratory. It can be taken together with Techniques in Organic Chemistry.",
    "2",
    "Yale-NUS College",
    "Yale-NUS College",
    "0-0-3-07",
    "YCC2132 Foundations of Science 2\nor\nconsent of instructor"
  ],
  [
    "YSC3234",
    "Principles of Biophysics",
    "This discussion seminar-style biophysics course will emphasize problem-solving skills (including computational) and laboratory techniques, focussing on applications of abstract concepts like statistical thermodynamics to biophysical phenomena, and the physics of soft condensed matter to \"squishy\" bio-molecules. Topics considered include protein folding, binding equilibria, self-assembly of biomolecules, membrane energetics. Some questions addressed are: why are lipids essential to life, what drives ions across membranes, how do proteins bind to receptors, how can physics of biopolymers (DNA, proteins) explain their function, how can we explain spontaneous order formation in biology?",
    "5",
    "Yale-NUS College",
    "Yale-NUS College",
    "0-(2-4)-3-3.5-(4-5)",
    "Sophomores can enroll with instructor’s permission. Given the physics bent of this course, it is recommended that students have taken or take concurrently some Calculus, in order to fully appreciate the content."
  ],
  [
    "YSC4200A",
    "Special Project in Science",
    "This course provides academic credit of major research projects conducted by students prior to the Capstone project. The scope and depth of the research should be at the level of a Capstone project, and thus requires unusually strong preparation in science. All projects must be approved by the Director of the Science Division before the course is selected.",
    "5",
    "Yale-NUS College",
    "Yale-NUS College",
    "0-0-0-12.5",
    "Unusually strong preparation in science, and prior approval of the Director of the Science Division."
  ],
  [
    "YSC4202",
    "Galois Theory",
    "Galois theory connects the symmetries of algebraic equations with their solubility. A triumph of 19th century algebra, Galois theory still plays a central role in modern arithmetic and geometry. Reviewing group theory, fields, and linear algebra along the way, this course will proceed through the main theorems of Galois theory. Highlights will include a modern treatment of the constructible numbers (e.g., the impossibility of trisecting angles with a rule and compass, the construction of the 17-gon) and the solubility of polynomials (e.g. solubility of the cubic and quartic, insolubility of the quintic).",
    "5",
    "Yale-NUS College",
    "Yale-NUS College",
    "04-0-0-8.5",
    "YSC2232 Linear Algebra or permission of instructor.  \nYSC3237 Introduction to Modern Algebra (or previously YSC3204 Group Theory) is strongly recommended."
  ],
  [
    "YSC4223",
    "Physics in Curved Spacetime",
    "The course introduces the basic ideas of relativity, with an emphasis on physical phenomena in curved spacetime. Special relativity will be reviewed, and the basic concepts and mathematics of general relativity introduced. We will then turn to physics in flat or curved spacetime. Physical phenomena covered may vary from year to year, but can include a selection from mechanics, electrodynamics, kinetic theory, quantum mechanics, gravitational lensing, black holes, gravitational waves, etc. The course teaches the physical relevance of the theory of relativity, and prepares the student for an advanced course in general relativity. Prior exposure to special relativity is assumed.",
    "5",
    "Yale-NUS College",
    "Yale-NUS College",
    "0-(Two 1.5 hour lectures + One 1-hr seminar)-0-5.5-3",
    "YSC2203 Classical Mechanics,\nYSC3210 Quantum Mechanics and\nYSC3211 Introduction to Electrodynamics\nOR with the permission of the instructor"
  ],
  [
    "YSH2409",
    "Short Course: Democracy and Justice",
    "A survey of the political theory literatures on democracy and justice with\nan eye to their implications for one another and for their relevance to\npolitical science research.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2410",
    "Short Course: Economic Inequality ‐ For Better or Worse",
    "This short course will evaluate the causes of, the case for, the cost of, and\npossible cures to economic inequality. Readings will be drawn from\nvarious disciplines including economics, sociology, anthropology, and\npolitical economy.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2411",
    "Short Course: Hispanic American Culture",
    "An intermediate level review of key Spanish grammar concepts (ser/estar,\npreterite/imperfect, subjunctive) through an exploration of themes related\nto the encounter of the Spaniards with indigenous peoples of Latin America.\nStudents will be asked to make connections between what is presented in\nclass and their own cultures. The course is conducted in Spanish.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2412",
    "Short Course: Franz Kafka - The Novel of Institution",
    "A predominant pattern in Western epics has been the ”Novel of Formation”\n(Bildungsroman) – the novel that follows an individual through the stages of\nher life. The last century has seen a radical reversal. Instead of narrating a\nlife’s development, the new novel concentrates on the institution that\nshapes individuals and renders them subjects (school, bureaucracy, court of\nlaw etc.). The German‐Czech writer Kafka is the master of the new genre. The\ncourse highlights Kafka’s “The Trial” as a “novel of institution” while drawing\non related works including “The Castle,” and exploring concepts such as\n“institution,” “novel,” “form of life.”",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2414",
    "Short Course: Human Spirit in Great Contemporary Novels",
    "The theme of search for meaning and happiness via rebellion of human spirit\nover the imposition of conformity is studied with a theoretical approach to\nexistentialism in works of the prominent 20th century writers: Chinese Wang\nXiaobo, Czech/French Milan Kundera, Russian Alexander Solzhenitsyn, and\nSingaporean Goh Poh Seng. Students are expected to highlight quotes of\ntheir own interest in each novel, which they will share during discussions.\nThey submit a 350‐word critical summary of novels before each class. A final\npaper of 8 pages and 2‐page‐scene (700 words) of creative fiction writing is\nexpected at the end of the course.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2415",
    "Short Course: Iconic Consciousness and Material Culture",
    "Modernity may be post‐traditional, but it is far from being thoroughly\nrationalized. Social meanings remain central, and the new approach of\n“cultural sociology” has emerged to study them. Providing an introduction to\ncultural sociology, this course focuses on one of its research programs – the\nstudy of material objects as iconic symbols. We begin with aesthetic theories\nof sensuous form and cultural theories of symbols and myth, then examine\nempirical studies ranging from motorcycle boys to Giacometti and\ncelebrities, from to vinyl records to the role of branded cultural consumption\nin post‐industrial societies.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2416",
    "Short Course: International Law",
    "This course will provide an introduction to international law. We will examine\nthe structure of the international legal system, sources of international law\n(treaties, customary international law, and general principles), the key actors\nin international law‐making (including international courts and tribunals,\ninternational organizations, and non‐governmental organizations), the\ncentral challenges to the international legal system, and the capacity of\ninternational law to shape state behaviour.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2417",
    "Short Course: Introduction to American Politics",
    "On successful completion of the course a student should be able to: identify\nand understand the major institutions of the American political system, grasp\nthe major forces that shape American governance today, and appreciate the\nmajor competing perspectives in political science that seek to explain\noutcomes and processes within American politics.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2418",
    "Short Course: Introduction to Nanoscience",
    "An introduction to the emerging discipline of nanotechnology. Topics include\nthe physical effects of nanoscale systems, the synthesis and fabrication of\nnanostructures, and their applications ranging from micromachines to\nelectronics to biology. Societal and economic impacts, as well as ethical\nissues created by nanotechnologies, will be discussed.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2419",
    "Short Course: Leo Tolstoy's Anna Karenina",
    "A reading of one of the greatest novels in Russian, European, and\nworld literature, with primary attention to interrelations of theme, form,\nand literary‐cultural context.\n\nThrough a reading of the Introduction to the instructor’s book on\nAnna Karenina, and discussions organized around leading questions\nthat focus on the text of the novel, the course will also introduce\nstudents to a reading methodology that is applicable to literature in\ngeneral and that seeks to avoid the kinds of ideological mediations\nthat are common in academic literary study.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2420",
    "Short Course: Randomness in Physics and Biology",
    "Molecules never sit still. They jiggle, bend, twist and spin erratically. While\nthe movement of individual molecules is impossible to\nanticipate, the collective behavior of large numbers of molecules can be\npredicted with surprising precision.\n\nIn this short course, you’ll learn how random processes play an essential role\nin the world around us. Our discussion will be driven by data from real\nexperiments in physics and biology. You’ll learn some of the basic\nmathematics of random variables, and use a computer to simulate random\nprocesses. You’ll apply these ideas to the behavior of individual molecules and\nexplore how predictable, and sometimes surprising, behavior can emerge in\nlarge systems. Examples will focus on the physics of everyday materials as\nwell as biology at the molecular and cellular scales.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ],
  [
    "YSH2421",
    "Short Course: Revolution and War ‐ The Impact of WW1",
    "World War I unleashed a dramatic wave of global revolution. Imperial\nauthority was challenged all over the world. But in the early 1920s the first\nonrush of revolution was halted. A new, liberal order took shape that was\nanchored on America and Britain’s global power. It was this, which triggered\na new generation of ultra‐radical insurgents whose challenge to the status\nquo would bring on the extreme violence of the 1930s and 1940s. Students\nwill be introduced to the key actors and thinkers of this drama, ranging from\nLenin and Gandhi, to Woodrow Wilson, Maynard Keynes, Hitler, Stalin and\nMao.",
    "1",
    "Yale-NUS College",
    "Yale-NUS College",
    "12-24"
  ]
]
